[
  {
    "url": "https://dl.acm.org/event.cfm?id=RE315",
    "id": "ACM SE",
    "title": "ACM Southeast Regional Conference",
    "categories": [
      "Computer crime",
      "Computer science education",
      "Data mining",
      "Design and analysis of algorithms",
      "Human computer interaction ",
      "Information retrieval",
      "Information science education",
      "Language features",
      "Model curricula",
      "Performance",
      "Project and people management",
      "Security and privacy",
      "Software design techniques",
      "Software development process management",
      "Software management"
    ],
    "description": "ACM Southeast Regional Conference the oldest, continuously running, annual conference of the ACM. ACMSE provides an excellent forum for both faculty and students to present their research in a friendly and dynamic atmosphere in all areas of computer science."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE288",
    "id": "ANCS",
    "title": "Architecture for Networking and Communications Systems",
    "categories": [
      "Communication hardware, interfaces and storage",
      "Dependable and fault-tolerant systems and networks",
      "Embedded and cyber-physical systems",
      "General and reference",
      "Network architectures",
      "Network monitoring",
      "Network performance evaluation",
      "Network protocols",
      "Network security",
      "Network services",
      "Networks",
      "Packet-switching networks",
      "Performance",
      "Real-time systems",
      "Routers"
    ],
    "description": "ANCS is a systems-oriented research conference, presenting original work that explores the relationship between the architecture of modern computer networks and the architecture of the individual hardware and software elements from which these networks are built. This year's conference will particularly emphasize insight into broader systems issues in its paper selection, to recognize and foster the growth of research that lies at the intersection of computer and network systems architecture."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE282",
    "id": "APGV",
    "title": "Applied Perception in Graphics & Visualization",
    "categories": [
      "3D imaging",
      "Animation",
      "Cognitive science",
      "Computer graphics",
      "Computer vision problems",
      "Computer vision",
      "Graphics systems and interfaces",
      "Human computer interaction ",
      "Image manipulation",
      "Mixed / augmented reality",
      "Perception",
      "Psychology",
      "Rendering",
      "Scene understanding",
      "Virtual reality"
    ],
    "description": "Research in computer graphics and visualization has great potential to benefit from, and contribute to, research in perception.\nThis symposium has brought together researchers from the fields of perception, graphics and visualization, to facilitate a wider exchange of ideas. Our goals are to use insights from perception to advance the design of methods for visual, auditory and haptic representation, and to use computer graphics to enable perceptual research that would otherwise not be possible.\nTo receive information and updates about APGV, you may subscribe to the APGV mailing list by sending an email to this address. To unsubscribe, send an email to this other addressResearch in computer graphics and visualization has great potential to benefit from, and contribute to, research in perception.\nThis symposium has brought together researchers from the fields of perception, graphics and visualization, to facilitate a wider exchange of ideas. Our goa"
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE381",
    "id": "ASE",
    "title": "Automated Software Engineering",
    "categories": [
      "Designing software",
      "Formal software verification",
      "Logic and verification",
      "Program verification",
      "Requirements analysis",
      "Software architectures",
      "Software design techniques",
      "Software development process management",
      "Software maintenance",
      "Software post-development issues",
      "Software reverse engineering",
      "Software testing and debugging",
      "Software verification and validation",
      "Software verification",
      "Verification"
    ],
    "description": "The ASE conference has become one of the world's premier Software Engineering venues. Software engineering is concerned with the analysis, design, implementation, testing, and maintenance of large software systems. Automated software engineering focuses on how to automate or partially automate these tasks to achieve significant improvements in quality and productivity.\nASE encourages the submission of technical research papers, experience reports, demonstrations, and short papers about emerging topics. In addition it features a doctoral symposium, several associated workshops, and a number of in-depth tutorials. The proceedings will be published in the ACM International Proceedings Series. Authors of selected papers will be invited for a special issue of the Journal of Automated Software Engineering, published by Springer."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE289",
    "id": "ASIA CCS",
    "title": "ACM Symposium on Information, Computer and Communications Security",
    "categories": [
      "Access control",
      "Authentication",
      "Computational complexity and cryptography",
      "Computer crime",
      "Cryptanalysis and other attacks",
      "Cryptography",
      "Data encryption",
      "Information theory",
      "Intrusion/anomaly detection and malware mitigation",
      "Network security",
      "Operating systems security",
      "Privacy-preserving protocols",
      "Public key techniques",
      "Public key encryption",
      "Security and privacy"
    ],
    "description": "To build on the success of ACM Conference on Computer and Communications Security (CCS) and ACM Transactions on Information and System Security (TISSEC), the ACM Special Interest Group on Security, Audit, and Control (SIGSAC) formally established the annual ACM Symposium on InformAtion, Computer and Communications Security (ASIACCS). \nASIACCS is a major international forum for information security researchers, practitioners, developers, and users to explore and exchange the newest cyber security ideas, breakthroughs, findings, techniques, tools, and experiences. We invite submissions from academia, government, and industry presenting novel research on all theoretical and practical aspects of computer and network security."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE387",
    "id": "ASPDAC",
    "title": "Asia and South Pacific Design Automation Conference",
    "categories": [
      "Computer-aided design",
      "Dependable and fault-tolerant systems and networks",
      "Electronics",
      "Emerging technologies",
      "Hardware test",
      "Hardware validation",
      "Hardware",
      "Integrated circuits",
      "Network performance evaluation",
      "Performance",
      "Physical design ",
      "Placement",
      "Robustness",
      "Very large scale integration design",
      "Wire routing"
    ],
    "description": "ASP-DAC is the annual international conference on VLSI design automation in Asia and South Pacific region, one of the most active regions of design and fabrication of silicon chips in the world.\nThe conference aims at providing the Asian and South Pacific CAD/DA and Design community with opportunities of presenting recent advances and with forums for future directions in technologies related to Electronic Design Automation (EDA). \nThe format of the meeting intends to cultivate and promote an instructive and productive interchange of ideas among EDA researchers/developers and system/circuit/device designers. All scientists, engineers, and students who are interested in theoretical and practical aspects of VLSI design and design automation are welcomed to ASP-DAC."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE178",
    "id": "ASPLOS",
    "title": "Architectural Support for Programming Languages and Operating Systems",
    "categories": [
      "Architectures",
      "Communication hardware, interfaces and storage",
      "Compilers",
      "Concurrent programming languages",
      "Dependable and fault-tolerant systems and networks",
      "Dynamic memory",
      "File systems management",
      "Memory management",
      "Multiple instruction, multiple data",
      "Network performance evaluation",
      "Operating systems",
      "Parallel architectures",
      "Parallel programming languages",
      "Performance",
      "Software testing and debugging"
    ],
    "description": "ASPLOS is a multi-disciplinary conference for research that spans the boundaries of hardware, computer architecture, compilers, languages, operating systems, networking, and applications. ASPLOS provides a high quality forum for scientists and engineers to present their latest research findings in these rapidly changing fields. It has captured some of the major computer systems innovations of the past two decades (e.g., RISC and VLIW processors, small and large-scale multiprocessors, clusters and networks-of-workstations, optimizing compilers, RAID, and network-storage system designs).\nThis conference occurs at a time when computer architecture is facing great challenges, due both to the end of single-processor performance scaling and to new demands imposed by mobile and gigascale computing. Multi-disciplinary research is increasingly important as boundaries between hardware/software and local/network computing blur, as the form and capabilities of computing devices beco"
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE205",
    "id": "ASSETS",
    "title": "ACM SIGACCESS Conference on Computers and Accessibility",
    "categories": [
      "Assistive technologies",
      "Auditory feedback",
      "Empirical studies in accessibility",
      "Graphical user interfaces",
      "Haptic devices",
      "HCI design and evaluation methods",
      "Human computer interaction ",
      "Human-centered computing",
      "Interaction devices",
      "Interaction paradigms",
      "Natural language interfaces",
      "People with disabilities",
      "Sound-based input / output",
      "Touch screens",
      "User centered design"
    ],
    "description": "Computer and Information Technologies have redesigned the way modern society operates. In particular, they have identified new avenues to assist individuals with special needs and provided tools and resources to alleviate the traditional barriers encountered by persons with disabilities. For example, speech generation systems have assisted persons with visual disabilities, voice recognition has helped people with motor impairments, multi-modal presentations have been shown to be effective in helping people with learning disabilities understand information.\nThe ASSETS series of conferences is aimed at providing a technical forum for presenting and disseminating innovative research results that address the use of computing and information technologies to help persons with disabilities.\nThe ASSETS meetings are developed with the specific focus of facilitating sharing of information, exchange of ideas, through formal paper sessions, demonstrations, posters, and in"
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE280",
    "id": "AUS-CE",
    "title": "Australian Computing Education",
    "categories": [
      "Collaborative learning",
      "Computer science education",
      "Computer supported cooperative work",
      "Computing education",
      "Distance learning",
      "E-learning",
      "Education",
      "Enterprise computing",
      "Human computer interaction ",
      "Information science education",
      "Information systems education",
      "Language types",
      "Model curricula",
      "Software and its engineering",
      "Software development techniques"
    ],
    "description": ""
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE402",
    "id": "BCB",
    "title": "Bioinformatics, Computational Biology and Biomedicine",
    "categories": [
      "Bioinformatics",
      "Biological networks",
      "Computational biology",
      "Computational genomics",
      "Consumer health",
      "Data mining",
      "Genetics",
      "Graph theory",
      "Health informatics",
      "Information systems applications",
      "Life and medical sciences",
      "Machine learning",
      "Natural language processing",
      "Supervised learning by classification",
      "Systems biology"
    ],
    "description": "ACM Conference on Bioinformatics, Computational Biology and Biomedicine (ACM BCB) is the main flagship conference of the newly formed ACM SIG Bioinformatics. We welcome papers that report new algorithms or novel computational approaches broadly in Bioinformatics, Computational Biology and Biomedicine. In addition to the emphasis on the novelty of computational techniques, we also encourage papers that report novel biological discovery through non-trivial data mining process by using existing computational techniques."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE326",
    "id": "C&C",
    "title": "Creativity and Cognition",
    "categories": [
      "Arts and humanities",
      "Collaborative and social computing",
      "Computer supported cooperative work",
      "Education",
      "Fine arts",
      "HCI theory, concepts and models",
      "Human computer interaction ",
      "Human-centered computing",
      "Interaction design theory, concepts and paradigms",
      "Multimedia information systems",
      "Music retrieval",
      "Performing arts",
      "Psychology",
      "Sound and music computing",
      "Virtual reality"
    ],
    "description": "The Creativity & Cognition (C&C) conference series have evolved into lively interdisciplinary meetings, bringing together artists and scientists, designers educators,and researchers. \nWe seek to understand human creativity in its many manifestations, to design new interactive techniques and tools to augment and amplify human creativity, and to use computational media technologies to explore new creative processes and artifacts in all human endeavors ranging from the arts to science, from design to education. \nWe welcome contributions from researchers and practitioners, from artists and scientists, from designers, educators and decision makers."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE182",
    "id": "CCS",
    "title": "Computer and Communications Security",
    "categories": [
      "Access control",
      "Authentication",
      "Computational complexity and cryptography",
      "Computer crime",
      "Cryptanalysis and other attacks",
      "Cryptography",
      "Data encryption",
      "Human and societal aspects of security and privacy",
      "Intrusion/anomaly detection and malware mitigation",
      "Network security",
      "Operating systems security",
      "Privacy policies",
      "Public key techniques",
      "Public key encryption",
      "Security and privacy"
    ],
    "description": "The annual ACM Computer and Communications Security Conference is a leading international forum for information security researchers, practitioners, developers, and users to explore cutting-edge ideas and results, and to exchange techniques, tools, and experiences. We invite submissions from academia, government, and industry presenting novel research on all theoretical and practical aspects of computer security, as well as case studies and implementation experiences."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE159",
    "id": "CF",
    "title": "Computing Frontiers Conference",
    "categories": [
      "Architectures",
      "Compilers",
      "Concurrent programming languages",
      "Dependable and fault-tolerant systems and networks",
      "Distributed architectures",
      "Dynamic memory",
      "Embedded and cyber-physical systems",
      "Multiple instruction, multiple data",
      "Network performance evaluation",
      "Parallel architectures",
      "Parallel programming languages",
      "Performance",
      "Real-time systems",
      "Reliability",
      "Robustness"
    ],
    "description": "The increasing complexity and performance needs of current and future applications require novel and innovative approaches for design of various types of computing systems: embedded, mobile, high-performance, and more. Boundaries between state of the art and revolutionary innovation constitute the computing frontiers that must be pushed forward to provide the computational support required for the advancement of science and engineering. This conference focuses on a wide spectrum of advanced technologies and radically new solutions relevant to development of computer systems and aims to foster communication among scientists and engineers to achieve this.\nAuthors are invited to submit full papers and poster-papers on all areas of innovative computing systems that extend the current frontiers of computer science and engineering. Submissions are sought on innovations in theory, methodologies, technologies, and implementation of advanced computer systems and focusing on computi"
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE256",
    "id": "CGO",
    "title": "Code Generation and Optimization",
    "categories": [
      "Compilers",
      "Concurrency",
      "Dependable and fault-tolerant systems and networks",
      "Document types",
      "General and reference",
      "Language types",
      "Memory management",
      "Network performance evaluation",
      "Parallel computing models",
      "Parallel programming languages",
      "Performance",
      "Program analysis",
      "Program semantics",
      "Runtime environments",
      "Source code generation"
    ],
    "description": "The International Symposium on Code Generation and Optimization (CGO) provides a premier venue to bring together researchers and practitioners working at the interface of hardware and software on a wide range of optimization and code generation techniques and related issues. The conferences spans the spectrum from purely static to fully dynamic approaches, including techniques ranging from pure software-based methods to architectural features and support. Original contributions are solicited in areas including but not limited to the following: Code Generation and Optimization, Parallelism, Static and Dynamic Analysis, OS, Architecture and Runtime Support, Security and Reliability, and Practical Experience."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE151",
    "id": "CHI",
    "title": "Conference on Human Factors in Computing Systems",
    "categories": [
      "Collaborative and social computing",
      "Computer supported cooperative work",
      "Graphical user interfaces",
      "HCI design and evaluation methods",
      "HCI theory, concepts and models",
      "Human computer interaction ",
      "Human-centered computing",
      "Interaction design theory, concepts and paradigms",
      "Interaction devices",
      "Interaction paradigms",
      "Multimedia information systems",
      "Personal computers and PC applications",
      "Touch screens",
      "User centered design",
      "Virtual reality"
    ],
    "description": "The ACM Conference on Human Factors in Computing Systems (CHI) series of academic conferences is generally considered the most prestigious in the field of human-computer interaction. It is hosted by ACM SIGCHI, the Special Interest Group on Computer-Human Interaction. CHI has been held annually since 1982 and attracts thousands of international attendees."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE302",
    "id": "CIKM",
    "title": "Conference on Information and Knowledge Management",
    "categories": [
      "Data mining",
      "Data warehouses",
      "Database design and models",
      "Database management system engines",
      "Database query processing and optimization ",
      "Database query processing",
      "Document filtering",
      "Document representation",
      "Information extraction",
      "Information retrieval query processing",
      "Information retrieval",
      "Information systems applications",
      "Language resources",
      "Natural language processing",
      "Retrieval models and ranking"
    ],
    "description": "The Conference on Information and Knowledge Management (CIKM) provides an international forum for presentation and discussion of research on information and knowledge management, as well as recent advances on data and knowledge bases. The purpose of the conference is to identify challenging problems facing the development of future knowledge and information systems, and to shape future directions of research by soliciting and reviewing high quality, applied and theoretical research findings. An important part of the conference is the Workshops program which focuses on timely research challenges and initiatives. CIKM has a strong tradition of workshops devoted to emerging areas of database management, IR, and related fields. Workshops vary from year to year. The ACM CIKM Website has information on past conferences."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE397",
    "id": "CODASPY",
    "title": "Data and Application Security and Privacy",
    "categories": [
      "Access control",
      "Authentication",
      "Authorization",
      "Computer crime",
      "Cryptanalysis and other attacks",
      "Database and storage security",
      "Human and societal aspects of security and privacy",
      "Intrusion/anomaly detection and malware mitigation",
      "Malware and its mitigation",
      "Mobile platform security",
      "Network security",
      "Operating systems security",
      "Security and privacy",
      "Software and application security",
      "Theory of database privacy and security"
    ],
    "description": "With rapid global penetration of the Internet and smart phones and the resulting productivity and social gains, the world is becoming increasingly dependent on its cyber infrastructure. Criminals, spies and predators of all kinds have learnt to exploit this landscape much quicker than defenders have advanced in their technologies. Security and Privacy has become an essential concern of applications and systems throughout their lifecycle. Security concerns have rapidly moved up the software stack as the Internet and web have matured. The security, privacy, functionality, cost and usability tradeoffs necessary in any practical system can only be effectively achieved at the data and application layers. This new conference provides a dedicated venue for high-quality research in this arena, and seeks to foster a community with this focus in cyber security."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE258",
    "id": "COMM",
    "title": "ACM SIGCOMM",
    "categories": [
      "Communication hardware, interfaces and storage",
      "Dependable and fault-tolerant systems and networks",
      "Distributed architectures",
      "Mobile networks",
      "Network architectures",
      "Network management",
      "Network monitoring",
      "Network performance evaluation",
      "Network protocols",
      "Network services",
      "Networks",
      "Packet-switching networks",
      "Performance",
      "Routing protocols",
      "Wireless access networks"
    ],
    "description": "SIGCOMM is the flagship annual conference of the ACM Special Interest Group on Data Communication (SIGCOMM) on the applications, technologies, architectures, and protocols for computer communication.\nSIGCOMM members include scientists, engineers, educators and students. They study all aspects of computer communications and networks: analysis, technical design, engineering, measurement and management. Our members are particularly interested in the systems engineering and architectural questions surrounding computer communication."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE340",
    "id": "CoNEXT",
    "title": "International Conference On Emerging Networking Experiments And Technologies",
    "categories": [
      "Communication hardware, interfaces and storage",
      "Dependable and fault-tolerant systems and networks",
      "Distributed architectures",
      "Mobile networks",
      "Network architectures",
      "Network management",
      "Network monitoring",
      "Network performance evaluation",
      "Network protocols",
      "Networks",
      "Performance",
      "Public Internet",
      "Routing protocols",
      "Transport protocols",
      "Wireless access networks"
    ],
    "description": "The International Conference on emerging Networking EXperiments and Technologies (CoNEXT) is a major forum for presentations and discussions of novel networking technologies that will shape the future of Internetworking..\nThe first goal of this conference is to provide a selective and interdisciplinary forum for research in Networking. The second goal is to foster meaningful technical interaction among members of our community. The conference is single track and features a high-quality technical program with significant opportunities for individual and small-group technical and social interactions among a diverse set of participants. The CoNEXT conferences focus on stimulating exchanges between various international research communities."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE173",
    "id": "CPR",
    "title": "Computers and People Research",
    "categories": [
      "Computer and information systems training",
      "Computer science education",
      "Computing and business",
      "Computing occupations",
      "Decision support systems",
      "Employment issues",
      "Enterprise computing",
      "Human computer interaction ",
      "Information systems applications",
      "Management of computing and information systems",
      "Professional topics",
      "Project and people management",
      "Project management techniques",
      "Project staffing",
      "Systems development"
    ],
    "description": "Today's competitive and dynamic information-based global society has created a gap between the available supply of information technology (IT) professionals and the demand for their skills and talents. Subsequently, practitioners and researchers are challenged with addressing this gap through the preparation, recruitment and retention of IT professionals. From an individual perspective, questions remain about the skill and knowledge requirements necessary to secure employment in an evolving environment (skills gap). From an educational perspective, programs are attempting to increase student enrollments despite dwindling funding and the recent economics crisis (enrollment and funding gaps). From an IT profession perspective, organizations continue to struggle to adequately manage their talent, provide career development and plan for succession as the baby boomers begin to retire (recruitment and retention gaps). Given these many challenges, the ACM SIGMIS CPR conference aims to co"
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE353",
    "id": "CPSWeek",
    "title": "Cyber-physical Systems",
    "categories": [
      "Communication hardware, interfaces and storage",
      "Compilers",
      "Control methods",
      "Distributed architectures",
      "Distributed systems organizing principles",
      "Embedded and cyber-physical systems",
      "Embedded systems",
      "Formal software verification",
      "Information systems applications",
      "Mobile networks",
      "Networks",
      "Performance",
      "Real-time systems",
      "Signal processing systems",
      "Wireless access networks"
    ],
    "description": "The CPSWeek brings together five leading conferences - HSCC, ICCPS, IPSN, LCTES, and RTAS - as well as several workshops and tutorials on various aspects on the research and development of cyber-physical systems: Embedded Systems, Hybrid Systems, Real-Time and Sensor Networks.\nCyber-physical Systems (CPS) are engineered systems whose operations are monitored, coordinated, controlled, and integrated by a computing and communication core embedded in all types of objects and structures in the physical environment. Such systems must be operated safely, dependably, securely, efficiently and in real-time. Advances in this field will have great technical, economic and societal impacts in the near future."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE169",
    "id": "CSCW",
    "title": "Computer Supported Cooperative Work",
    "categories": [
      "Collaborative and social computing design and evaluation methods",
      "Collaborative and social computing theory, concepts and paradigms",
      "Collaborative and social computing",
      "Computer supported cooperative work",
      "Computing / technology policy",
      "Computing and business",
      "Enterprise information systems",
      "Human computer interaction ",
      "Human-centered computing",
      "Information systems",
      "Internet communications tools",
      "Social and professional topics",
      "Synchronous editors",
      "Web conferencing",
      "Web-based interaction"
    ],
    "description": "The ACM Conference on Computer Supported Cooperative Work (CSCW) is a premier venue for presenting research in the design and use of technologies that affect groups, organizations, and communities. The development and application of new technologies continues to enable new ways of working together and coordinating activities. Although work is an important area of focus for the conference, technology is increasingly supporting a wide range of recreational and social activities. CSCW has also embraced an increasing range of devices, as we collaborate from different contexts and situations. The conference brings together top researchers and practitioners from academia and industry who are interested in both the technical and social aspects of collaboration."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE175",
    "id": "CSE",
    "title": "Computer Science Education",
    "categories": [
      "Collaborative learning",
      "Computer science education",
      "Computer-assisted instruction",
      "Computing education",
      "Computing literacy",
      "Education",
      "Enterprise computing",
      "Human computer interaction ",
      "Information science education",
      "Information systems education",
      "K-12 education",
      "Language types",
      "Model curricula",
      "Object oriented languages",
      "Software and its engineering"
    ],
    "description": "The ACM Special Interest Group on Computer Science Education provides a forum for educators to discuss issues related to the development, implementation, and/or evaluation of computing programs, curricula, and courses, as well as syllabi, laboratories, and other elements of teaching and pedagogy."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE213",
    "id": "DAC",
    "title": "Design Automation Conference",
    "categories": [
      "Computer-aided design",
      "Dependable and fault-tolerant systems and networks",
      "Emerging technologies",
      "Engineering",
      "Functional verification",
      "Hardware test",
      "Integrated circuits",
      "Logic circuits",
      "Network performance evaluation",
      "Performance",
      "Physical design ",
      "Placement",
      "Robustness",
      "Simulation and emulation",
      "Very large scale integration design"
    ],
    "description": "The Design Automation Conference is the world's leading technical conference and trade show on electronic design automation. DAC is where the IC Design and EDA ecosystem learns, networks, and does business. DAC is also where the latest technical research is presented. DAC covers all topics related to the design complex systems on chip: Embedded System design & verification down to physical layout verification & test. Now in its 48th consecutive year, DAC is the most respected name in the chip design community."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE268",
    "id": "DEBS",
    "title": "Distributed Event-based Systems",
    "categories": [
      "Database query processing and optimization ",
      "Database query processing",
      "Dependable and fault-tolerant systems and networks",
      "Distributed architectures",
      "Distributed programming languages",
      "Distributed retrieval",
      "Distributed storage",
      "Distributed systems organizing principles",
      "Information systems applications",
      "Network performance evaluation",
      "Organizing principles for web applications",
      "Peer-to-peer retrieval",
      "Performance",
      "Software architectures",
      "Stream management"
    ],
    "description": "Event-based systems are rapidly gaining importance in many application domains ranging from real time monitoring systems in production, logistics and networking to complex event processing in finance and security. The event based paradigm has gathered momentum as witnessed by current efforts in areas including publish/subscribe systems, event-driven architectures, complex event processing, business process management and modelling, Grid computing, Web services notifications, information dissemination, event stream processing, and message-oriented middleware. The various communities dealing with event based systems have made progress in different aspects of the problem. The DEBS conference attempts to bring together researchers and practitioners active in the various sub communities to share their views and reach a common understanding."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE170",
    "id": "DOC",
    "title": "Design of Communication",
    "categories": [
      "Collaborative and social computing systems and tools",
      "Computer supported cooperative work",
      "Document preparation",
      "Documentation",
      "Enterprise information systems",
      "HCI design and evaluation methods",
      "Human computer interaction ",
      "Human-centered computing",
      "Hypertext / hypermedia",
      "Information retrieval",
      "Multi / mixed media creation",
      "Project and people management",
      "Publishing",
      "User centered design",
      "World Wide Web"
    ],
    "description": "SIGDOC focuses on the design of communication as it is taught, practiced, researched, and conceptualized in various fields, including technical communication, software engineering, information architecture, usability, and areas of design such as graphic, user interface, and Web design.\nMembers of SIGDOC include information design professionals, educators, software engineers, researchers, Web designers, system developers, usability specialists, computer scientists, user interface designers, and information technology specialists."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE135",
    "id": "DocEng",
    "title": "Document Engineering",
    "categories": [
      "Digital libraries and archives",
      "Document analysis",
      "Document management and text processing",
      "Document management",
      "Document preparation",
      "Document representation",
      "Document scripting languages",
      "Format and notation",
      "Hypertext / hypermedia creation",
      "Hypertext / hypermedia",
      "Information retrieval",
      "Markup languages",
      "Multi / mixed media creation",
      "Natural language processing",
      "Publishing"
    ],
    "description": "Document engineering is the computer science discipline that investigates systems for documents in any form and in all media. As with the relationship between software engineering and software, document engineering is concerned with principles, tools and processes that improve our ability to create, manage, and maintain documents. The ACM Symposium on Document Engineering is an annual academic conference, sponsored by ACM SIGWEB and in-cooperation with ACM SIGDOC.\nThe ACM Symposium on Document Engineering provides an annual international forum for presentations and discussions on principles, tools and processes that improve our ability to create, manage and maintain documents. It is sponsored by ACM by means of the ACM SIGWEB Special Interest Group. All DocEng Proceedings are available through the ACM Digital Library."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE343",
    "id": "DS-RT",
    "title": "Distributed Simulation and Real-Time Applications",
    "categories": [
      "Dependable and fault-tolerant systems and networks",
      "Distributed architectures",
      "Distributed simulation",
      "Distributed systems organizing principles",
      "Document types",
      "Embedded and cyber-physical systems",
      "General and reference",
      "Mixed / augmented reality",
      "Modeling and simulation",
      "Network performance evaluation",
      "Performance",
      "Real-time systems",
      "Simulation evaluation",
      "Simulation support systems",
      "Virtual reality"
    ],
    "description": "DS-RT serves as a forum for simulationists from academia, industry and\nresearch labs, for presenting recent research results in Distributed Simulation and\nReal Time Applications. DS-RT targets the growing overlap between large distributed simulations and real time applications, such as collaborative virtual environments pervasive and ubiquitous application scenarios, motor-, controller-, sensor- and actuator systems.\nThe conference features prominent invited speakers as well as papers by top researchers in the field. DS-RT includes contributed technical papers, invited papers, and panel discussions."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE332",
    "id": "EC",
    "title": "Electronic Commerce",
    "categories": [
      "Algorithmic game theory and mechanism design",
      "Algorithmic game theory",
      "Algorithmic mechanism design",
      "Computational pricing and auctions",
      "Design and analysis of algorithms",
      "Discrete mathematics",
      "Distributed artificial intelligence",
      "Economics",
      "Electronic commerce",
      "Human computer interaction ",
      "Information systems applications",
      "Law, social and behavioral sciences",
      "Multi-agent systems",
      "Secure online transactions",
      "Theory of computation"
    ],
    "description": "Since 1999, the ACM Special Interest Group on Electronic Commerce (SIGECOM) outlink has sponsored the leading scientific conference on advances in theory, systems, and applications for electronic commerce. The EC symposium features invited speakers, paper presentations, workshops, and tutorials covering all areas of electronic commerce. The natural focus of the conference is on computer science issues, but the conference is interdisciplinary in nature."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE136",
    "id": "EICS",
    "title": "Engineering Interactive Computing Systems",
    "categories": [
      "Computer supported cooperative work",
      "Designing software",
      "Graphical user interfaces",
      "HCI design and evaluation methods",
      "HCI theory, concepts and models",
      "Human computer interaction ",
      "Human-centered computing",
      "Integrated and visual development environments",
      "Interaction design theory, concepts and paradigms",
      "Interaction devices",
      "Interface design prototyping",
      "Software design techniques",
      "Software development process management",
      "Touch screens",
      "User centered design"
    ],
    "description": "EICS is an international conference devoted to the engineering of usable and effective interactive computing systems. Systems of interest include traditional workstation-based interactive systems, new and emerging modalities (e.g., gesture), entertaining applications (e.g., mobile and ubiquitous games) and development methods (e.g., extreme programming).\nEICS focuses on methods and techniques, and the tools that support them, for designing and developing interactive systems. It brings together people who study or practice the engineering of interactive systems, drawing from the HCI, Software Engineering, Requirements Engineering, CSCW, Ubiquitous / Pervasive Systems and Game Development communities."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE242",
    "id": "ESEM",
    "title": "Empirical Software Engineering and Measurement",
    "categories": [
      "Arts and humanities",
      "Computer games",
      "Human computer interaction ",
      "Human-centered computing",
      "Interactive games",
      "Massively multiplayer online games",
      "Metrics",
      "Mixed / augmented reality",
      "Multimedia information systems",
      "Project and people management",
      "Software and its engineering",
      "Software development process management",
      "Software management",
      "Software testing and debugging",
      "Virtual reality"
    ],
    "description": "The objective of the International Symposium on Empirical Software Engineering and Measurement (ESEM) is to provide a forum where researchers and practitioners can report and discuss recent research results in the area of empirical software engineering and metrics.\nThis conference encourages the exchange of ideas that help understand, from an empirical viewpoint, the strengths and weaknesses of software engineering technologies. The conference focuses on the processes, design and structure of empirical studies, and the results of specific studies. These studies may vary from controlled experiments to field studies and from quantitative to qualitative studies."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE345",
    "id": "ESWEEK",
    "title": "Embedded Systems Week",
    "categories": [
      "Communication hardware, interfaces and storage",
      "Compilers",
      "Computer-aided design",
      "Dependable and fault-tolerant systems and networks",
      "Designing software",
      "Embedded and cyber-physical systems",
      "Embedded software",
      "Embedded systems",
      "Hardware validation",
      "Model development and analysis",
      "Modeling methodologies",
      "Performance",
      "Real-time systems software",
      "Real-time systems",
      "Source code generation"
    ],
    "description": "Embedded Systems Week is an exciting event which brings together conferences, tutorials, and workshops centered on various aspects of embedded systems research and development. Three leading conferences in the area - CASES, CODES+ISSS, and EMSOFT - will take place at the same time and location, allowing attendees to benefit from a wide range of topics covered by these conferences and their associated tutorials and workshops."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE110",
    "id": "ETRA",
    "title": "Eye Tracking Research and Applications",
    "categories": [
      "Cognitive science",
      "Computer vision problems",
      "Computer vision",
      "Empirical studies in HCI",
      "HCI design and evaluation methods",
      "Human computer interaction ",
      "Image manipulation",
      "Interaction devices",
      "Interaction paradigms",
      "Machine learning",
      "Psychology",
      "Scene understanding",
      "Touch screens",
      "Tracking",
      "Virtual reality"
    ],
    "description": "ETRA is a biennial symposium focused on all aspects of eye movement research across a wide range of disciplines. The goal of ETRA is to bring together computer scientists, engineers and behavioral scientists in support of a common vision of enhancing eye tracking research and applications."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE101",
    "id": "EuroSys",
    "title": "European Conference on Computer Systems",
    "categories": [
      "Computer crime",
      "Concurrent programming languages",
      "Dependable and fault-tolerant systems and networks",
      "Distributed architectures",
      "Distributed programming languages",
      "Distributed systems organizing principles",
      "File systems management",
      "Network performance evaluation",
      "Operating systems security",
      "Operating systems",
      "Performance",
      "Reliability",
      "Scheduling",
      "Security and privacy",
      "Software performance"
    ],
    "description": "The EuroSys conferences are organised by EuroSys, the European Chapter of SIGOPS, sponsored by ACM SIGOPS.\nThe EuroSys conference series brings together professionals from academia and industry. It has a strong focus on systems research and development: operating systems, data base systems, real-time systems and middleware for networked, distributed, parallel, or embedded computing systems. As a highly recognized conference, EuroSys has become a premier forum for discussing various issues of systems software research and development, including implications related to hardware and applications.\nFuture EuroSys conferences will follow the pattern established by the previous EuroSys conferences, by seeking papers on all aspects of computer systems. EuroSys conferences will also include a number of workshops to allow junior and senior members of the systems community to explore leading-edge topics and ideas before they are presented at a conference."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE116",
    "id": "FPGA",
    "title": "International Symposium on Field Programmable Gate Arrays",
    "categories": [
      "Application specific processors",
      "Application-specific VLSI designs",
      "Embedded and cyber-physical systems",
      "Emerging technologies",
      "Hardware test",
      "High-level and register-transfer level synthesis",
      "Logic circuits",
      "Physical design ",
      "Placement",
      "Real-time systems",
      "Reconfigurable computing",
      "Reconfigurable logic and FPGAs",
      "Robustness",
      "Very large scale integration design",
      "Wire routing"
    ],
    "description": "The ACM/SIGDA International Symposium on Field-Programmable Gate Arrays is the premier conference for presentation of advances in all areas related to FPGA technology. For FPGA conferences, we solicit original submissions describing novel research and developments in the following (and related) areas of interest:\n* FPGA Architecture: Novel logic block architectures, combination of FPGA fabric and system blocks (DSP, processors, memories, etc.), design of routing fabric, I/O interfaces, new commercial architectures and architectural features.\n* FPGA Circuit Design: Novel FPGA circuits and circuit-level techniques, impact of process and design technologies, methods for analyzing and improving issues with soft-errors, leakage, static and dynamic power, clocking, power grid, yield, manufacturability, reliability, test; studies on future device technologies (e.g. nano-scale, 3D gate) for FPGAs.\n* CAD for FPGAs: Placement, routing, retiming, log"
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE201",
    "id": "FSE",
    "title": "Foundations of Software Engineering",
    "categories": [
      "Designing software",
      "Development frameworks and environments",
      "Formal software verification",
      "Program verification",
      "Project and people management",
      "Software and its engineering",
      "Software architectures",
      "Software configuration management and version control systems",
      "Software design techniques",
      "Software development process management",
      "Software maintenance",
      "Software post-development issues",
      "Software testing and debugging",
      "Software verification",
      "Verification"
    ],
    "description": "ACM SIGSOFT / FSE is one of the premier forums for researchers, practitioners and educators to present and discuss the most recent ideas, innovations, trends, and experiences in the field of software engineering. The distinctive features of FSE are an emphasis on the foundations of the field, the relatively small scale of the event, and the intense intellectual engagement among participants."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE290",
    "id": "GECCO",
    "title": "Genetic and Evolutionary Computation Conference",
    "categories": [
      "Artificial intelligence",
      "Computational biology",
      "Control methods",
      "Design and analysis of algorithms",
      "Dynamic programming",
      "Evolutionary algorithms",
      "Genetics",
      "Heuristic function construction",
      "Machine learning",
      "Markov decision processes",
      "Mathematical optimization",
      "Neural networks",
      "Robotic planning",
      "Search methodologies",
      "Systems biology"
    ],
    "description": "The Genetic and Evolutionary Computation Conferences present the latest high-quality results in the growing field of genetic and evolutionary computation. Topics include: genetic algorithms, genetic programming, evolution strategies, evolutionary programming, real-world applications, learning classifier systems and other genetics-based machine learning, evolvable hardware, artificial life, adaptive behavior, ant colony optimization, swarm intelligence, biological applications, evolutionary robotics, coevolution, artificial immune systems, and more."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE349",
    "id": "GIS",
    "title": "Geographic Information Systems",
    "categories": [
      "Computational geometry",
      "Data mining",
      "Database query processing and optimization ",
      "Database query processing",
      "Design and analysis of algorithms",
      "Document representation",
      "Geographic information systems",
      "Geographic visualization",
      "Human computer interaction ",
      "Information retrieval",
      "Information storage systems",
      "Information systems applications",
      "Randomness, geometry and discrete structures",
      "Shape modeling",
      "Spatial-temporal systems"
    ],
    "description": "The ACM SIGSPATIAL International Conferences on Advances in Geographic Information Systems are events in a series of symposia and workshops that began in 1993 with the aim of bringing together researchers, developers, users, and practitioners carrying out research and development in novel systems based on geo-spatial data and knowledge, and fostering interdisciplinary discussions and research in all aspects of geographic information systems. The conferences provide a forum for original research contributions covering all conceptual, design, and implementation aspects of GIS ranging from applications, user interfaces, and visualization to storage management and indexing issues. These conferences are the premier annual events of the ACM Special Interest Group on Spatial Information (ACM SIGSPATIAL). Researchers, students, and practitioners are invited to submit their contributions."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE118",
    "id": "GLSVLSI",
    "title": "Great Lakes Symposium on VLSI",
    "categories": [
      "Application specific processors",
      "Arithmetic and datapath circuits",
      "Computer-aided design",
      "Emerging technologies",
      "Hardware test",
      "Hardware validation",
      "High-level and register-transfer level synthesis",
      "Integrated circuits",
      "Logic circuits",
      "Physical design ",
      "Placement",
      "Robustness",
      "Simulation and emulation",
      "Very large scale integration design",
      "Wire routing"
    ],
    "description": "Original, unpublished papers, describing research in the general area of VLSI are solicited. Both theoretical and experimental research results are welcome. Program Tracks: \nVLSI Design: design of ASICs, microprocessors/micro-architectures, embedded processors, analog/digital/mixed-signal systems, NoC, interconnects, memories, and FPGAs. \nVLSI Circuits: analog/digital/mixed-signal circuits, RF and communication circuits, chaos/neural/fuzzy-logic circuits, high-speed/low-power circuits. \nComputer-Aided Design (CAD): hardware/software co-design, logic and behavioral synthesis, logic mapping, simulation and formal verification, layout (partitioning, placement, routing, floorplanning, compaction), algorithms and complexity analysis. \nLow Power and Power Aware Design: circuits, micro-architectural techniques, thermal estimation and optimization, power estimation methodologies, and CAD tools. \nTesting, Reliability, Fault-Toler"
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE168",
    "id": "GPCE",
    "title": "Generative Programming and Component Engineering",
    "categories": [
      "Compilers",
      "Designing software",
      "Domain specific languages",
      "Language features",
      "Language types",
      "Object oriented languages",
      "Reusability",
      "Software architectures",
      "Software design techniques",
      "Software development process management",
      "Software libraries and repositories",
      "Software testing and debugging",
      "Source code generation",
      "Specialized application languages",
      "System description languages"
    ],
    "description": "Generative and component approaches are revolutionizing software development similar to how automation and components revolutionized manufacturing. Generative Programming (developing programs that synthesize other programs), Component Engineering (raising the level of modularization and analysis in application design), and Domain-Specific Languages (elevating program specifications to compact domain-specific notations that are easier to write, maintain, and analyze) are key technologies for automating program development.\nGPCE provides a venue for researchers and practitioners interested in foundational techniques for enhancing the productivity, quality, and time-to-market in software development that stems from deploying standard components and automating program generation. In addition to exploring cutting-edge techniques for developing generative and component-based software, our goal is to foster further cross-fertilization between the software engineering research com"
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE210",
    "id": "GROUP",
    "title": "Supporting Group Work",
    "categories": [
      "Automation",
      "Business process management",
      "Collaborative and social computing design and evaluation methods",
      "Collaborative and social computing theory, concepts and paradigms",
      "Collaborative and social computing",
      "Computer supported cooperative work",
      "Enterprise applications",
      "Enterprise information systems",
      "Human computer interaction ",
      "Human-centered computing",
      "Information systems applications",
      "Internet communications tools",
      "Synchronous editors",
      "Systems analysis and design",
      "Web-based interaction"
    ],
    "description": "GROUP conferences are interested in topics related to computer-based systems that have an impact on groups, organizations and social networks. A strong emphasis of GROUP conferences is to foster a discourse on collaborative technology that bridges the fields of Computer Supported Cooperative Work (CSCW) and Information Systems (IS). Relevant issues include the design, implementation, deployment, evaluation, and impact of these systems as well as examinations of relevant research methodologies."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE142",
    "id": "HotMobile",
    "title": "Mobile Computing Systems and Applications",
    "categories": [
      "Communication hardware, interfaces and storage",
      "Dependable and fault-tolerant systems and networks",
      "Distributed architectures",
      "Embedded and cyber-physical systems",
      "Human computer interaction ",
      "Information systems applications",
      "Mobile networks",
      "Network architectures",
      "Network performance evaluation",
      "Networks",
      "Operating systems security",
      "Performance",
      "Personal computers and PC applications",
      "Real-time systems",
      "Wireless access networks"
    ],
    "description": "The Workshops on Mobile Computing Systems and Applications (HotMobile) are a series of highly selective, interactive workshops focused on mobile applications, systems, and environments, as well as their underlying state-of-the-art technologies. HotMobile's small workshop format makes it ideal for processing and discussing new directions or controversial approaches.\nWe solicit submissions of position papers that focus primarily on applications and systems and that propose new directions of research, advocate non-traditional approaches to old (or new) ideas, or generate controversy and discussion.\nYou can find a list of past workshops at www.hotmobile.org."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE300",
    "id": "HPDC",
    "title": "High Performance Distributed Computing",
    "categories": [
      "Concurrent programming languages",
      "Dependable and fault-tolerant systems and networks",
      "Distributed architectures",
      "Distributed programming languages",
      "Distributed retrieval",
      "Distributed storage",
      "Distributed systems organizing principles",
      "Information systems applications",
      "Modeling methodologies",
      "Network performance evaluation",
      "Organizing principles for web applications",
      "Parallel programming languages",
      "Peer-to-peer retrieval",
      "Performance",
      "Reliability"
    ],
    "description": "HPDC is the premier computer science conference for presenting new results relating to large scale high performance and distributed systems used in science and industry. For twenty years, HPDC has been at the center of new discoveries in clusters, grids, clouds, and parallel and multicore computers. HPDC is sponsored by the Association for Computing Machinery and the conference proceedings are published by the ACM Digital Library."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE174",
    "id": "HPG",
    "title": "High Performance Graphics",
    "categories": [
      "3D imaging",
      "Animation",
      "Computational geometry",
      "Computer graphics",
      "Graphics processors",
      "Graphics systems and interfaces",
      "Image manipulation",
      "Parallel computing methodologies",
      "Parametric curve and surface models",
      "Randomness, geometry and discrete structures",
      "Rasterization",
      "Ray tracing",
      "Rendering",
      "Shape modeling",
      "Texturing"
    ],
    "description": "High-Performance Graphics conferences synthesize two important and cutting-edge topics in computer graphics:\n* Graphics Hardware, represented since 1986 by an annual conference of that name focusing on graphics hardware, architecture, and systems since 1986.\n* Interactive Ray Tracing, represented since 2006 in an innovative symposium focusing on the emerging field of interactive ray tracing and global illumination techniques.\nBy combining these two communities, we bring to authors and attendees the best of both, while extending the scope of the conference to cover the overarching field of performance-oriented graphics systems covering innovative algorithms, efficient implementations, and hardware architecture. This broader focus offers a common forum bringing together researchers, engineers, and architects to discuss the complex interactions of massively parallel hardware, novel programming models, efficient graphics algorithms, an"
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE285",
    "id": "HRI",
    "title": "ACM/IEEE International Conference on Human-Robot Interaction",
    "categories": [
      "Cognitive robotics",
      "Cognitive science",
      "Command and control",
      "Empirical studies in HCI",
      "External interfaces for robotics",
      "HCI design and evaluation methods",
      "Human computer interaction ",
      "Human-centered computing",
      "Interaction paradigms",
      "Psychology",
      "Robotic autonomy",
      "Robotic planning",
      "Robotics",
      "User centered design",
      "User studies"
    ],
    "description": "Robots are becoming part of people's everyday social lives - and will increasingly become so. In future years, robots may become caretaking assistants for the elderly, or academic tutors for our children, or medical assistants, day care assistants, or psychological counsellors. Robots may become our co-workers in factories and offices, or maids in our homes. They may become our friends. As we move to create our future with robots, hard problems in human-robot interaction (HRI) exist, both technically and socially. The Fifth Annual Conference on HRI seeks to take up grand technical and social challenges in the field - and speak to their integration. HRI is a single-track, highly selective annual conference that seeks to showcase the very best research in human-robot interaction with roots in robotics, psychology, cognitive science, HCI, human factors, artificial intelligence, organizational behavior, anthropology, and many other fields. We invite broad participation."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE226",
    "id": "HT",
    "title": "Hypertext and Hypermedia",
    "categories": [
      "Computer supported cooperative work",
      "Digital libraries and archives",
      "Document representation",
      "Human computer interaction ",
      "Hypertext / hypermedia creation",
      "Hypertext / hypermedia",
      "Information retrieval query processing",
      "Information retrieval",
      "Information storage systems",
      "Information systems applications",
      "Interaction paradigms",
      "Multi / mixed media creation",
      "Visualization techniques",
      "Web applications",
      "Web services"
    ],
    "description": "The annual Hypertext conference is the only event dedicated totally to hypertext and hypermedia, in all its forms, covering all its uses, and which seeks both technical and literary contributions. The conference will include a range of participatory events such as papers, workshops, tutorials, panel discussions and more."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE299",
    "id": "I3D",
    "title": "Symposium on Interactive 3D Graphics and Games",
    "categories": [
      "3D imaging",
      "Animation",
      "Computational geometry",
      "Computer graphics",
      "Graphics input devices",
      "Graphics processors",
      "Graphics systems and interfaces",
      "Image manipulation",
      "Parametric curve and surface models",
      "Randomness, geometry and discrete structures",
      "Rendering",
      "Shape modeling",
      "Texturing",
      "Virtual reality",
      "Volumetric models"
    ],
    "description": "ACM I3D is the leading-edge conference for real-time 3D computer graphics and human interaction. We invite you to submit papers across the entire range of topics in interactive 3D graphics."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE384",
    "id": "ICAC",
    "title": "International Conference on Autonomic Computing and Communications",
    "categories": [
      "Availability",
      "Dependable and fault-tolerant systems and networks",
      "Designing software",
      "Design",
      "Distributed architectures",
      "Distributed systems organizing principles",
      "File systems management",
      "Maintainability and maintenance",
      "Modeling methodologies",
      "Network performance evaluation",
      "Operating systems",
      "Performance",
      "Reliability",
      "Software architectures",
      "System management"
    ],
    "description": "Large-scale computer systems present numerous challenges: from Grids and clouds to enterprise datacenters and Internet services, resources and applications must be managed to maximize performance and power efficiency while maintaining predictable and reliable behavior in the face of varying workloads and failures. A system that addresses these challenges by integrating monitoring, decision processing and actuation is an Autonomic Computing System.\nResearch in autonomic computing spans a variety of areas, from computer systems, architecture, databases and networks to machine learning and control theory. The purpose of ICAC is to bring together researchers and practitioners across these disciplines to address the multiple facets of self-management in computing systems and applications."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE219",
    "id": "ICCAD",
    "title": "International Conference on Computer-Aided Design",
    "categories": [
      "Computer-aided design",
      "Emerging technologies",
      "Engineering",
      "Hardware test",
      "Hardware validation",
      "High-level and register-transfer level synthesis",
      "Integrated circuits",
      "Logic circuits",
      "Performance",
      "Physical design ",
      "Placement",
      "Robustness",
      "Simulation and emulation",
      "Very large scale integration design",
      "Wire routing"
    ],
    "description": "The International Conference on Computer-Aided Design (ICCAD) continues to be the premier and most selective conference devoted to technical innovations in design automation."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE325",
    "id": "ICE",
    "title": "International Conference on Information and Computation Economies",
    "categories": [
      "Communication hardware, interfaces and storage",
      "Dependable and fault-tolerant systems and networks",
      "E-learning",
      "Information system economics",
      "Mathematical software",
      "Mobile information processing systems",
      "Modeling and simulation",
      "Network performance evaluation",
      "Network protocols",
      "Network services",
      "Networks",
      "Performance",
      "Pricing and resource allocation",
      "Public Internet",
      "Transport protocols"
    ],
    "description": ""
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE286",
    "id": "ICER",
    "title": "International Computing Education Research Workshop",
    "categories": [
      "Collaborative learning",
      "Computational thinking",
      "Computer science education",
      "Computer-assisted instruction",
      "Computing education",
      "Computing literacy",
      "CS1",
      "Education",
      "Information science education",
      "Information systems education",
      "Interactive learning environments",
      "K-12 education",
      "Model curricula",
      "Software testing and debugging",
      "Student assessment"
    ],
    "description": "Computing education, as a research discipline, is the study of how people come to understand computational processes and devices, and how to improve that understanding. As computation becomes ubiquitous in our world, understanding of computing in order to design, structure, maintain, and utilize these technologies becomes increasingly important--both for the technology professional, but also for the technologically literate citizen. The research study of how the understanding of computation develops, and how to improve that understanding, is critically important for the technology-dependent societies in which we live.\nLearning: Computing education is naturally concerned with how students make sense of computational processes and devices in formal education, including primary, secondary, and post-secondary institutions. Computing education also goes beyond formal education. What do adults understand about computation, and how do they come to that understanding? What do chil"
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE307",
    "id": "ICFP",
    "title": "International Conference on Functional Programming",
    "categories": [
      "Compilers",
      "Concurrent programming languages",
      "Formal language definitions",
      "Formal languages and automata theory",
      "Functional languages",
      "Lambda calculus",
      "Language features",
      "Language types",
      "Logic",
      "Parallel programming languages",
      "Polymorphism",
      "Program semantics",
      "Semantics and reasoning",
      "Software testing and debugging",
      "Type structures"
    ],
    "description": "ICFP (International Conference on Functional Programming) is an annual programming language conference. It is sponsored by the Association for Computing Machinery (ACM) under the aegis of the ACM Special Interest Group on Programming Languages (SIGPLAN), in association with Working Group 2.8 of the International Federation of Information Processing (IFIP). ICFP combined two former biennial conferences: Functional Programming and Computer Architecture (FPCA) and Lisp and Functional Programming (LFP)\nICFP provides a forum for researchers and developers to hear about the latest work on the design, implementations, principles, and uses of functional programming. The conference covers the entire spectrum of work, from practice to theory, including its peripheries."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE354",
    "id": "ICMI-MLMI",
    "title": "Multimodal Interfaces and Machine Learning for Multimodal Interaction",
    "categories": [
      "Cognitive science",
      "Computer vision",
      "Haptic devices",
      "HCI design and evaluation methods",
      "Human computer interaction ",
      "Interaction devices",
      "Interaction paradigms",
      "Machine learning",
      "Natural language interfaces",
      "Natural language processing",
      "Psychology",
      "Scene understanding",
      "Sound-based input / output",
      "Touch screens",
      "Virtual reality"
    ],
    "description": "The main aim of ICMI-MLMI is to further scientific research within the broad field of multimodal interaction, methods, and systems, focusing on major trends and challenges, and working towards identifying a roadmap for future research and commercial success. The conference will continue to feature a single-track with keynote speakers, technical paper presentations, poster sessions, a doctoral consortium, and demonstrations of state of the art multimodal systems and concepts. The conference will be followed by workshops."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE313",
    "id": "ICPE",
    "title": "ACM/SPEC International Conference on Performance Engineering",
    "categories": [
      "Cloud computing",
      "Dependable and fault-tolerant systems and networks",
      "Evaluation of retrieval results",
      "Measurement",
      "Metrics",
      "Modeling and simulation",
      "Modeling methodologies",
      "Network performance evaluation",
      "Performance",
      "Software and its engineering",
      "Software architectures",
      "Software development process management",
      "Software management",
      "Software performance",
      "Software selection and adaptation"
    ],
    "description": "The goal of the International Conference on Performance Engineering (ICPE) is to integrate theory and practice in the field of performance engineering by providing a forum for sharing ideas and experiences between industry and academia. ICPE is an annual conference that originated from the merger of the ACM Workshop on Software and Performance (WOSP) with the SPEC International Performance Engineering Workshop (SIPEW) in 2010. Nowadays, complex systems of all types, like Web-based systems, data centers and cloud infrastructures, social networks, peer-to-peer, mobile and wireless systems, cyber-physical systems, the Internet of Things, real-time and embedded systems, have increasingly distributed and dynamic system architectures that provide high flexibility, however, also increase the complexity of managing end-to-end application performance.\n\nICPE brings together researchers and industry practitioners to share and present their experiences, discuss challenges, and report"
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE215",
    "id": "ICS",
    "title": "International Conference on Supercomputing",
    "categories": [
      "Architectures",
      "Compilers",
      "Concurrency",
      "Concurrent programming languages",
      "Dependable and fault-tolerant systems and networks",
      "Grid computing",
      "Massively parallel and high-performance simulations",
      "Multicore architectures",
      "Multiple instruction, multiple data",
      "Network performance evaluation",
      "Parallel architectures",
      "Parallel computing models",
      "Parallel programming languages",
      "Performance",
      "Superscalar architectures"
    ],
    "description": "ICS (International Conference on Supercomputing) is the premier international forum for the presentation of research results in high-performance computing systems. \nPapers are solicited on all aspects of research, development, and application of large-scale, high-performance experimental and commercial systems. The list of topics includes (but not limited to):\n* Computationally challenging scientific and commercial applications, particularly studies and experiences on large-scale systems;\n* Computer architecture and hardware, including multicore and multiprocessor systems, accelerators, memory, interconnection networks and storage and file systems;\n* High-performance computational and programming models, including new languages and middleware for high performance computing, autotuning and function-specific code generators;\n* High performance system software, including compilers, runtime systems, programming and"
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE228",
    "id": "ICSE",
    "title": "International Conference on Software Engineering",
    "categories": [
      "Designing software",
      "Formal software verification",
      "Metrics",
      "Project and people management",
      "Requirements analysis",
      "Software and its engineering",
      "Software architectures",
      "Software configuration management and version control systems",
      "Software creation and management",
      "Software design techniques",
      "Software development process management",
      "Software maintenance",
      "Software management",
      "Software post-development issues",
      "Software testing and debugging"
    ],
    "description": "ICSE, the International Conference on Software Engineering,® is the premier software engineering conference, providing a forum for researchers, practitioners and educators to present and discuss the most recent innovations, trends, experiences and concerns in the field of software engineering. Note that ICSE: International Conference on Software Engineering® is a registered trademark.\nOn this web site you can find information about the ICSE conference series as well as useful information for organizing a future ICSE conference."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE293",
    "id": "ICUIMC",
    "title": "International Conference on Ubiquitous Information Management and Communication",
    "categories": [
      "Communication hardware, interfaces and storage",
      "Computer vision",
      "Data mining",
      "Human computer interaction ",
      "Information retrieval",
      "Information systems applications",
      "Machine learning",
      "Mobile networks",
      "Network architectures",
      "Network protocols",
      "Networks",
      "Operating systems security",
      "Performance",
      "Retrieval models and ranking",
      "Wireless access networks"
    ],
    "description": "This conference explores emerging interests and novel ideas in the area of\ninformation management, communication technologies and their implication\nof social interaction. The aim of the Fifth International Conference on\nUbiquitous Information Management and Communication is to provide a forum\npromoting new visionary approaches and interdisciplinary researches. The\nconference brings researchers together from academia and industry,\nencourages the exchanges of ideas and information, and provides a unique\nopportunity in which both technology and social science meet. Two main\ntracks for information processing management and communication will be\nheld, covering both research and application works of information\nmanagement, intelligent information processing, interaction management,\nnetworking/telecommunications, and social interaction.\nEach of these topic areas is expanded below but their sub-topics are not\nlisted exhaustively:\nInformation Processing Man"
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE194",
    "id": "IDEAS",
    "title": "International Database Engineering & Applications Symposium",
    "categories": [
      "Data management systems",
      "Data mining",
      "Data warehouses",
      "Database design and models",
      "Database management system engines",
      "Database query processing and optimization ",
      "Database query processing",
      "Distributed architectures",
      "Information retrieval",
      "Information storage systems",
      "Information systems applications",
      "Parallel and distributed DBMSs",
      "Query languages",
      "Relational database model",
      "Relational database query languages"
    ],
    "description": "The aim of the IDEAS series of symposiums is to address the engineering and application aspects of databases. \nThe symposium provides an international forum for discussion of the problems of engineering database systems involving not only database technology but the related areas of information retrieval, multimedia, human machine interface and communication. The goal of IDEAS is to foster closer interaction among the industrial, research and user communities and provides an excellent opportunity for them to meet, discuss ideas, examine the current ones and develop new solutions and research directions. Along with the technical sessions, the symposium also features prominent invited speakers.\nIDEAS series of symposiums are scheduled annually and have been held since 1997 in North America, Europe and Asia. It has attracted participants from governmental and non-governmental agencies, industries, and academia to exchange ideas and share experiences."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE625",
    "id": "IH&MMSec",
    "title": "Information Hiding and Multimedia Security",
    "categories": [
      "Authentication",
      "Computer crime",
      "Computer vision tasks",
      "Computer vision",
      "Cryptography",
      "Domain-specific security and privacy architectures",
      "Human and societal aspects of security and privacy",
      "Image manipulation",
      "Image processing",
      "Information systems applications",
      "Information systems",
      "Information theory",
      "Intellectual property",
      "Security and privacy",
      "Software architectures"
    ],
    "description": "For over a decade, two workshops have been shaping the landscape of research in multimedia security. On one hand, Information Hiding (aka. IH) was created in 1996 and focused on digital watermarking, steganography and steganalysis, anonymity and privacy, hard to intercept communications and covert/subliminal channels. On the other hand, the ACM Workshop on Multimedia and Security (aka. ACM MMSec) was initiated in 1998 and focused on data hiding, robust/perceptual hash, biometrics, video surveillance, and multimedia forensics. Key seminal works have been published in these two workshops and papers accepted for publication there attracted over 9,000 citations in total. Year after year, the two communities grew closer and the overlap between their respective scope got bigger. As a result, after 14 successful editions each, IH and ACM MMSec decided to merge in a single event in an attempt to establish synergies between the two communities while building on the reputation obtained over the"
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE154",
    "id": "IMC",
    "title": "Internet Measurement Conference",
    "categories": [
      "Communication hardware, interfaces and storage",
      "Measurement",
      "Metrics",
      "Network architectures",
      "Network components",
      "Network management",
      "Network measurement",
      "Network monitoring",
      "Network protocols",
      "Network services",
      "Network structure",
      "Networks",
      "Performance",
      "Public Internet",
      "Transport protocols"
    ],
    "description": "The Internet Measurement Conference is an annual conference focusing on Internet measurement and analysis, sponsored by ACM SIGCOMM and ACM SIGMETRICS in cooperation with USENIX. The aim is that papers presented at the conference contribute to the current understanding of how to collect or analyze Internet measurements, or give insight into how the Internet behaves.\nIMC was begun as a workshop in 2001 in response to the difficulty at that time finding appropriate publication/presentation venues for high-quality Internet measurement research. \nThe conference is generally held in late October or early November. In its first two years as a Workshop, attendance was limited, but now as a conference it is open to all interested in attending.\nPapers are submitted in May with notifications in July and camera-ready papers due in August. The acceptance rate to date has been around 25%. IMC is usually open to both full-length papers and extended abstracts,"
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE160",
    "id": "IR",
    "title": "Research and Development in Information Retrieval",
    "categories": [
      "Clustering and classification",
      "Clustering",
      "Digital libraries and archives",
      "Document filtering",
      "Document representation",
      "Evaluation of retrieval results",
      "Information extraction",
      "Information retrieval query processing",
      "Information retrieval",
      "Information storage systems",
      "Information systems applications",
      "Natural language processing",
      "Relevance assessment",
      "Retrieval models and ranking",
      "Search engine indexing"
    ],
    "description": "SIGIR is the major international forum for the presentation of new research results and for the demonstration of new systems and techniques in the broad field of information retrieval (IR). SIGIR welcomes contributions related to any aspect of IR theory and foundation, techniques, and applications.\nRelevant topics include, but are not limited to:\nDocument Representation and Content Analysis (e.g., text representation, document structure, linguistic analysis, non-English IR, cross-lingual IR, information extraction, sentiment analysis, clustering, classification, topic models, facets)\nQueries and Query Analysis (e.g., query representation, query intent, query log analysis, question answering, query suggestion, query reformulation)\nUsers and Interactive IR (e.g., user models, user studies, user feedback, search interface, summarization, task models, personalized search)\nRetrieval Models and Ranking (e.g., IR theory, language models, probabilistic retrieval models, featur"
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE239",
    "id": "ISCA",
    "title": "International Symposium on Computer Architecture",
    "categories": [
      "Architectures",
      "Compilers",
      "Complex instruction set computing",
      "Dependable and fault-tolerant systems and networks",
      "Dynamic memory",
      "Hardware validation",
      "Interconnection architectures",
      "Modeling methodologies",
      "Multiple instruction, multiple data",
      "Network performance evaluation",
      "Parallel architectures",
      "Performance",
      "Reduced instruction set computing",
      "Semiconductor memory",
      "Very long instruction word"
    ],
    "description": "The ISCA conference is the premier forum for new ideas and experimental results in computer architecture.\nNovel papers are solicited on a broad range of topics, including, but not limited to:\nProcessor, memory, and storage systems architecture\nInterconnection networks\nInstruction, thread, and data-level parallelism\nDependable architectures\nArchitecture support for security\nPower and energy efficient architectures\nApplication specific, reconfigurable, and embedded architectures\nNetwork processor and router architectures\nArchitectures for emerging technologies and applications\nArchitecture modeling and performance evaluation"
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE120",
    "id": "ISLPED",
    "title": "International Symposium on Low Power Electronics and Design",
    "categories": [
      "Dependable and fault-tolerant systems and networks",
      "Dynamic memory",
      "Electronics",
      "Embedded and cyber-physical systems",
      "Emerging technologies",
      "Hardware validation",
      "Integrated circuits",
      "Logic circuits",
      "Network performance evaluation",
      "Performance",
      "Physical design ",
      "Real-time systems",
      "Robustness",
      "Semiconductor memory",
      "Very large scale integration design"
    ],
    "description": "The International Symposium on Low Power Electronics and Design (ISLPED) is the premier forum for presentation of recent advances in all aspects of low power design and technologies, ranging from process and circuit technologies, to simulation and synthesis tools, to system level design and optimization."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE149",
    "id": "ISMM",
    "title": "International Symposium on Memory Management",
    "categories": [
      "Allocation / deallocation strategies",
      "Compilers",
      "Concurrent programming languages",
      "Dynamic compilers",
      "File systems management",
      "Garbage collection",
      "Language features",
      "Language types",
      "Measurement",
      "Memory management",
      "Metrics",
      "Program analysis",
      "Program semantics",
      "Runtime environments",
      "Storage management"
    ],
    "description": "ISMM is a forum for research in memory management. Areas of interest include but are not limited to:\n* Memory allocation and deallocation\n* Garbage collection algorithms and implementations\n* Compiler analyses and tools to aid memory management\n* Empirical analysis of heap intensive programs\n* Formal analysis and verification of heap intensive programs\n* Memory system design and analysis\n* Verification of memory management algorithms\n* Development and evaluation of open source implementations\nISMM solicits full-length submissions covering new work on these topics, as well as papers presenting confirmations or refutations of important prior results. Surveys and comparative analyses that shed new light on previously published techniques are also welcome."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE238",
    "id": "ISPD",
    "title": "International Symposium on Physical Design",
    "categories": [
      "Circuit optimization",
      "Computer-aided design",
      "Emerging technologies",
      "Engineering",
      "Hardware validation",
      "Integrated circuits",
      "Logic circuits",
      "Mathematical software",
      "Partitioning and floorplanning",
      "Physical design ",
      "Placement",
      "Robustness",
      "Simulation and emulation",
      "Very large scale integration design",
      "Wire routing"
    ],
    "description": "The International Symposium on Physical Design (ISPD) provides a premier forum to exchange ideas and promote research on critical areas related to the physical design of VLSI systems.\nAll aspects of physical design, including its interactions with architecture, behavioral- and logic-level synthesis, and back-end performance analysis and verification are within the scope of the symposium. Target domains include semi-custom and full-custom IC, regular fabrics, FPGA, and systems-on-chip/systems-in-package."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE222",
    "id": "ISSTA",
    "title": "International Symposium on Software Testing and Analysis",
    "categories": [
      "Concurrent programming languages",
      "Empirical software validation",
      "Formal software verification",
      "Metrics",
      "Parallel programming languages",
      "Process validation",
      "Program semantics",
      "Program verification",
      "Software design techniques",
      "Software development process management",
      "Software testing and debugging",
      "Software verification and validation",
      "Software verification",
      "Validation",
      "Verification"
    ],
    "description": "ISSTA is the leading research conference in software testing and analysis, bringing together academics, industrial researchers, and practitioners to exchange new ideas, problems, and experience on how to analyze and test software systems. The ISSTA program will include technical papers, keynotes, workshops, and a doctoral symposium."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE274",
    "id": "ITE",
    "title": "Information Technology Education Conference",
    "categories": [
      "Accreditation",
      "Computer crime",
      "Computer science education",
      "Computing education",
      "Computing literacy",
      "Distance learning",
      "E-learning",
      "Education",
      "Information science education",
      "Information systems education",
      "Information technology education",
      "Intrusion/anomaly detection and malware mitigation",
      "Model curricula",
      "Professional topics",
      "Security and privacy"
    ],
    "description": "SIGITE is the Association for Computing Machinery's Special Interest Group for Information Technology Education. SIGITE's mission is to provide a forum for the interaction of practitioners, educators, and others in the field of Information Technology Education in order to exchange ideas and engage in activities that advance the knowledge of its members, the curriculum and teaching on Information Technology Curriculum, and the development and transfer of innovative concepts and applications in technology and pedagogy. SIGITE currently has a focused effort on the development of a model curriculum and guidelines for accreditation. Educators from two- and four-year universities and colleges as well as high school teachers are welcome and would benefit from SIGITE's activities. Practitioners in the field would also benefit from some of the technical tracks and offer valuable input for content for future employees.\nInformation Technology (IT) in its broadest sense encompasses a"
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE279",
    "id": "ITiCSE",
    "title": "Innovation and Technology in Computer Science Education",
    "categories": [
      "Collaborative learning",
      "Computer science education",
      "Computer-assisted instruction",
      "Computing education",
      "CS1",
      "Distance learning",
      "E-learning",
      "Education",
      "Human computer interaction ",
      "Information science education",
      "Information systems education",
      "Language types",
      "Model curricula",
      "Object oriented languages",
      "Software and its engineering"
    ],
    "description": "ITiCSE is sponsored by the ACM Special Interest Group on Computer Science Education (SIGCSE). The program of the conference consists of keynote lectures, paper sessions, working groups, exhibits, panels, posters, courseware demonstrations, tips and techniques."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE306",
    "id": "IUI",
    "title": "Intelligent User Interfaces",
    "categories": [
      "Graphical user interfaces",
      "HCI design and evaluation methods",
      "Human computer interaction ",
      "Human-centered computing",
      "Information retrieval",
      "Information systems applications",
      "Integrated and visual development environments",
      "Interaction design theory, concepts and paradigms",
      "Interaction devices",
      "Interaction paradigms",
      "Multimedia information systems",
      "Natural language interfaces",
      "Natural language processing",
      "Touch screens",
      "User centered design"
    ],
    "description": "n March 1988, a group of researchers gathered in Monterey, California to participate in a workshop titled: \"Architectures for Intelligent Interfaces\". It was the beginning of what at first would be a slow but steady development of the field of Intelligent User Interfaces. Three years later, the book \"Intelligent User Interfaces\" was published edited by Joe Sullivan and Sherman Tyler, the organizers of the workshop. The book highlighted the main papers presented in the workshop and served as a basis for not only future work, but also future events that continued that work. It was not until 1993, however, that Bill Hefley organized the First International Workshop on Intelligent User Interfaces, which took place in Orlando, Florida. The event, sponsored by ACM, attracted a nascent group of researchers whose work clearly defined the field as a novel and promising intersection of Artificial Intelligence and Human-Computer Interaction."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE113",
    "id": "JCDL",
    "title": "Joint Conference on Digital Libraries",
    "categories": [
      "Computing standards, RFCs and guidelines",
      "Digital libraries and archives",
      "Document collection models",
      "Document filtering",
      "Document representation",
      "Human computer interaction ",
      "Hypertext / hypermedia",
      "Information extraction",
      "Information retrieval query processing",
      "Information retrieval",
      "Information storage systems",
      "Information systems applications",
      "Natural language processing",
      "Retrieval models and ranking",
      "Search engine indexing"
    ],
    "description": "Since 2001, the Joint Conference on Digital Libraries has served as the major international forum focused on digital libraries and associated technical, practical, and social issues. JCDL encompasses the many meanings of the term \"digital libraries,\" including (but not limited to) new forms of information institutions; operational information systems with all manner of digital content; new means of selecting, collecting, organizing, and distributing digital content; and theoretical models of information media, including document genres and electronic publishing. Digital libraries may be viewed as a new form of information institution or as an extension of the services libraries currently provide. Representatives from academe, government, industry, and others are invited to participate in this annual conference. The conference draws from a broad array of disciplines including computer science, information science, librarianship, archival science and practice, museum studies and practice"
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE112",
    "id": "K-CAP",
    "title": "Knowledge Capture",
    "categories": [
      "Artificial intelligence",
      "Document representation",
      "Document types",
      "Expert systems",
      "Information retrieval",
      "Information systems applications",
      "Knowledge representation and reasoning",
      "Language resources",
      "Learning settings",
      "Logic",
      "Machine learning",
      "Natural language processing",
      "Philosophical/theoretical foundations of artificial intelligence",
      "Rule learning",
      "Semantic networks"
    ],
    "description": "In today's knowledge-driven world, effective access to and use of information is a key enabler for progress. Modern technologies not only are themselves knowledge-intensive technologies, but also produce enormous amounts of new information that we must process and aggregate. These technologies require knowledge capture, which involve the extraction of useful knowledge from vast and diverse sources of information as well as its acquisition directly from users. Driven by the demands for knowledge-based applications and the unprecedented availability of information on the Web, the study of knowledge capture has a renewed importance.\nResearchers that work in the area of knowledge capture traditionally belong to several distinct research communities, including knowledge engineering, machine learning, natural language processing, human-computer interaction, artificial intelligence and the Semantic Web. K-CAP provides a forum that brings together members of disparate research com"
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE329",
    "id": "KDD",
    "title": "Knowledge Discovery and Data Mining",
    "categories": [
      "Classification and regression trees",
      "Cluster analysis",
      "Clustering and classification",
      "Clustering",
      "Data mining",
      "Document filtering",
      "Document representation",
      "Information extraction",
      "Information retrieval",
      "Information systems applications",
      "Machine learning",
      "Natural language processing",
      "Neural networks",
      "Supervised learning by classification",
      "Web-based interaction"
    ],
    "description": "The annual ACM SIGKDD conference is the premier international forum for data mining researchers and practitioners from academia, industry, and government to share their ideas, research results and experiences. The KDD conferences feature keynote presentations, oral paper presentations, poster sessions, workshops, tutorials, panels, exhibits, demonstrations, and the KDD Cup competition."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE187",
    "id": "METRICS",
    "title": "Measurement and Modeling of Computer Systems",
    "categories": [
      "Communication hardware, interfaces and storage",
      "Dependable and fault-tolerant systems and networks",
      "Distributed architectures",
      "Distributed systems organizing principles",
      "Measurement",
      "Metrics",
      "Modeling methodologies",
      "Network architectures",
      "Network performance evaluation",
      "Network protocols",
      "Networks",
      "Performance",
      "Queueing theory",
      "Scheduling algorithms",
      "Software performance"
    ],
    "description": "SIGMETRICS is the flagship conference of the ACM special interest group for the computer systems performance evaluation community.\nThe ACM SIGMETRICS conference solicits papers on the development and application of state-of-the-art, broadly applicable analytic, simulation, and measurement-based performance evaluation techniques. Of particular interest is work that furthers the state-of-the-art in performance evaluation methods, or work that creatively apply previously developed methods to understand or gain important insights into key design trade-offs in computer or network systems."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE203",
    "id": "MICRO",
    "title": "Microarchitecture",
    "categories": [
      "Application specific instruction set processors",
      "Architectures",
      "Arithmetic and datapath circuits",
      "Compilers",
      "Control structures",
      "Dependable and fault-tolerant systems and networks",
      "Design modules and hierarchy",
      "Dynamic memory",
      "Hardware validation",
      "Hardware",
      "Integrated circuits",
      "Methodologies for EDA",
      "Network performance evaluation",
      "Performance",
      "Semiconductor memory"
    ],
    "description": "MICRO is the premier forum for presenting, discussing and debating new and innovative microarchitecture ideas and techniques for advanced computing and communication systems. The goal of this symposium is to bring together researchers in fields related to processor architecture, compilers, and systems, for technical exchange on traditional MICRO topics as well as new emerging research areas. Historically, the MICRO community has enjoyed having close interaction between academic researchers and industrial designers."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE319",
    "id": "Middleware",
    "title": "Middleware Conference",
    "categories": [
      "Communication hardware, interfaces and storage",
      "Dependable and fault-tolerant systems and networks",
      "Distributed architectures",
      "Distributed storage",
      "Distributed systems organizing principles",
      "Domain specific languages",
      "Information retrieval",
      "Information systems applications",
      "Network architectures",
      "Network performance evaluation",
      "Networks",
      "Organizing principles for web applications",
      "Performance",
      "Software architectures",
      "Software performance"
    ],
    "description": "The Middleware Conference is a forum for the discussion of important innovations and recent advances in the design, construction and uses of middleware. Middleware is a distributed-system software that resides between applications and underlying platforms (operating systems; databases; hardware), and/or ties together distributed applications, databases or devices. Its primary role is to coordinate and enable communication between different layers or components while isolating much of the complexity of distribution into a single, well tested and well understood system abstraction."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE179",
    "id": "MM",
    "title": "International Multimedia Conference",
    "categories": [
      "Computer vision problems",
      "Computer vision tasks",
      "Computer vision",
      "Document representation",
      "Human computer interaction ",
      "Image and video acquisition",
      "Information retrieval",
      "Information systems applications",
      "Multimedia information systems",
      "Retrieval models and ranking",
      "Scene understanding",
      "Search engine indexing",
      "Video segmentation",
      "Video summarization",
      "Virtual reality"
    ],
    "description": "ACM Multimedia is the worldwide premier multimedia conference and a key event to display scientific achievements and innovative industrial products. The Conference offers to scientists and practitioners a range of plenary scientific and technical sessions, tutorials, panels and discussion meetings on relevant and challenging questions on the horizon of multimedia. The Interactive Art program provides the opportunity of interaction between artists and computer scientists and investigation on the application of multimedia technologies to art and cultural heritage."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE366",
    "id": "MobiCom",
    "title": "Mobile Computing and Networking",
    "categories": [
      "Communication hardware, interfaces and storage",
      "Dependable and fault-tolerant systems and networks",
      "Distributed architectures",
      "Embedded and cyber-physical systems",
      "Mobile networks",
      "Network architectures",
      "Network performance evaluation",
      "Network protocols",
      "Network structure",
      "Networks",
      "Performance",
      "Real-time systems",
      "Routing protocols",
      "Signal processing systems",
      "Wireless access networks"
    ],
    "description": "The ACM MobiCom Conference, sponsored by ACM SIGMOBILE, is dedicated to addressing the challenges in the areas of mobile computing and wireless and mobile networking. The MobiCom Conference serves as the premier international forum addressing networks, systems, algorithms, and applications that support the symbiosis of mobile computers and wireless networks. MobiCom is a highly selective conference focusing on all issues in mobile computing and wireless and mobile networking at the physical layer and above."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE367",
    "id": "MobiHoc",
    "title": "Mobile and Ad Hoc Networking and Computing",
    "categories": [
      "Communication hardware, interfaces and storage",
      "Design and analysis of algorithms",
      "Distributed architectures",
      "Distributed systems organizing principles",
      "Mobile networks",
      "Modeling methodologies",
      "Network architectures",
      "Network flows",
      "Network protocols",
      "Network structure",
      "Networks",
      "Organizing principles for web applications",
      "Performance",
      "Routing protocols",
      "Wireless access networks"
    ],
    "description": "The ACM International Symposium on Mobile Ad Hoc Networking and Computing, known as MobiHoc, is sponsored by ACM SIGMOBILE> It focuses on the latest research in the rapidly growing area of mobile ad hoc networking and computing, bringing together researchers and practitioners from a broad spectrum of wireless networking research to present the most up-to-date results and achievements in the field. The symposium will include a highly selective technical program, hands-on research demonstrations, a distinguished keynote address, and panels."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE191",
    "id": "MobiSys",
    "title": "Mobile Systems, Applications, and Services",
    "categories": [
      "Communication hardware, interfaces and storage",
      "Distributed architectures",
      "Distributed systems organizing principles",
      "Embedded and cyber-physical systems",
      "Human computer interaction ",
      "Information systems applications",
      "Measurement",
      "Mobile networks",
      "Network architectures",
      "Network protocols",
      "Networks",
      "Organizing principles for web applications",
      "Personal computers and PC applications",
      "Real-time systems",
      "Wireless access networks"
    ],
    "description": "The annual MobiSys Conference seeks to present innovative and significant research on the design, implementation, usage, and evaluation of mobile computing and wireless systems, applications, and services. It is jointly sponsored by ACM SIGMOBILE and the USENIX association in cooperation with ACM SIGOPS."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE227",
    "id": "MOD",
    "title": "International Conference on Management of Data",
    "categories": [
      "Data management systems",
      "Data mining",
      "Database design and models",
      "Database management system engines",
      "Database query languages ",
      "Database query processing and optimization ",
      "Database query processing",
      "Database transaction processing",
      "Document representation",
      "Information retrieval query processing",
      "Information retrieval",
      "Information systems applications",
      "Parallel and distributed DBMSs",
      "Query languages",
      "Relational database model"
    ],
    "description": "The annual ACM SIGMOD/PODS conference is a leading international forum for database researchers, practitioners, developers, and users to explore cutting-edge ideas and results, and to exchange techniques, tools, and experiences."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE318",
    "id": "MSWiM",
    "title": "Modeling, Analysis and Simulation of Wireless and Mobile Systems",
    "categories": [
      "Communication hardware, interfaces and storage",
      "Distributed architectures",
      "Mobile networks",
      "Model development and analysis",
      "Model verification and validation",
      "Modeling and simulation",
      "Modeling methodologies",
      "Network architectures",
      "Network performance evaluation",
      "Network protocols",
      "Network structure",
      "Networks",
      "Performance",
      "Routing protocols",
      "Wireless access networks"
    ],
    "description": "The ACM MSWiM Conference features symposia and workshops on emerging topics related to wireless networking and mobile computing."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE401",
    "id": "Nanoarch",
    "title": "IEEE/ACM International Symposium on Nanoscale Architectures",
    "categories": [
      "Analysis and design of emerging devices and systems",
      "Application-specific VLSI designs",
      "Arithmetic and datapath circuits",
      "Electronics",
      "Emerging architectures",
      "Emerging technologies",
      "Hardware test",
      "Hardware validation",
      "Interconnect",
      "Logic circuits",
      "Parallel architectures",
      "Physical design ",
      "Robustness",
      "Semiconductor memory",
      "Very large scale integration design"
    ],
    "description": "NANOARCH is the annual cross-disciplinary forum for the discussion of novel post-CMOS nanocomputing directions. The symposium seeks papers on innovative ideas for solutions to the principal challenge facing integrated electronics in the 21st century - how to design, fabricate, and integrate nanosystems to overcome the fundamental limitations of CMOS. In particular, such systems could (1) contain unconventional nanodevices with unique capabilities, including directions beyond simple switches, (2) introduce new logic and memory concepts, (3) involve novel circuit styles, (4) introduce new concepts for computing, (5) reconfigure and/or mask faults at much higher rates than in CMOS, (6) involve new paradigms for manufacturing, and (7) rethink the methodologies and design tools involved."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE298",
    "id": "NOSSDAV",
    "title": "Network and Operating Systems Support for Digital Audio and Video",
    "categories": [
      "Communication hardware, interfaces and storage",
      "Dependable and fault-tolerant systems and networks",
      "Distributed architectures",
      "Distributed systems organizing principles",
      "Image and video acquisition",
      "Multimedia information systems",
      "Multimedia streaming",
      "Network architectures",
      "Network protocols",
      "Networks",
      "Organizing principles for web applications",
      "Performance",
      "Public Internet",
      "Video segmentation",
      "Video summarization"
    ],
    "description": "The NOSSDAV Conference is the leading workshop on network and operating systems support for digital audio and video. The conference focus is on emerging research topics, controversial ideas, and future research directions in the area of multimedia systems research.\nNOSSDAV encourages experimental research based on real systems and real data sets. Public availability of the source code and data sets discussed in papers presented at NOSSDAV is highly encouraged. Papers are accepted on a broad ranges of topics related to the transmission and presentation of digital audio/video objects, particularly systems-level support for distributed social networking, local dispatching, performance aspects of multi-core processors, etc."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE267",
    "id": "NPAR",
    "title": "Non-Photorealistic Animation and Rendering",
    "categories": [
      "3D imaging",
      "Animation",
      "Computational geometry",
      "Computer graphics",
      "Fine arts",
      "Graphics input devices",
      "Graphics recognition and interpretation",
      "Graphics systems and interfaces",
      "Image manipulation",
      "Parametric curve and surface models",
      "Performing arts",
      "Randomness, geometry and discrete structures",
      "Rendering",
      "Shape modeling",
      "Simulation by animation"
    ],
    "description": "The international NPAR symposium is dedicated to non-photorealistic animation and rendering. The symposium is sponsored by ACM SIGGRAPH and is held in cooperation with Eurographics.\nNon-photorealistic animation and rendering (NPAR) refers to computational techniques for visual communication. Such techniques usually generate imagery and motion which is expressive, rather than photorealistic, although they may incorporate realistic elements. Researchers, artists, and practitioners of all areas connected to non-photorealistic animation and rendering are invited to submit papers and posters on their work. The three categories of submissions are: Research (including new algorithms, scientific studies, analysis, and data); Production (including candid discussions of the process of creating a work or art tool); Meta (including statements about research that do not contain new results, e.g., grand challenges, position papers, evaluation standards, surveys, and primers on art/aest"
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE206",
    "id": "PACT",
    "title": "Parallel Architectures and Compilation Techniques",
    "categories": [
      "Architectures",
      "Compilers",
      "Concurrent programming languages",
      "Document types",
      "Dynamic memory",
      "Hardware validation",
      "Multicore architectures",
      "Multiple instruction, multiple data",
      "Parallel architectures",
      "Parallel computing models",
      "Parallel programming languages",
      "Performance",
      "Runtime environments",
      "Single instruction, multiple data",
      "Source code generation"
    ],
    "description": "The International Conference on Parallel Architectures and Compilation Techniques (PACT) is the premier international forum for the presentation of research results in parallel computing. PACT is a multi-disciplinary conference, bringing together researchers and practitioners in areas including instruction-level parallelism, thread-level parallelism, multiprocessor parallelism and large scale systems."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE235",
    "id": "PADS",
    "title": "Principles of Advanced and Distributed Simulation",
    "categories": [
      "Concurrency",
      "Dependable and fault-tolerant systems and networks",
      "Discrete-event simulation",
      "Distributed simulation",
      "Document types",
      "Massively parallel and high-performance simulations",
      "Model development and analysis",
      "Model verification and validation",
      "Modeling and simulation",
      "Modeling methodologies",
      "Network performance evaluation",
      "Network protocols",
      "Parallel computing models",
      "Performance",
      "Simulation evaluation"
    ],
    "description": "The PADS workshop has expanded its traditional focus on parallel and distributed simulation methods and applications to cover all aspects of simulation technology, including the following areas:\n* The construction of simulation engines using advanced computer science technology.\n* Techniques for constructing scalable simulations.\n* Advanced modeling techniques that allow solution of previously difficult or impossible problem domains.\n* Simulation visualization techniques.\n* Algorithms and methods for parallel or distributed simulation, including synchronization, scheduling, memory management, and load balancing.\n* Applications of large-scale or distributed simulation methods.\n* Distributed interactive simulation and distributed virtual environments.\n* Tools and techniques for interoperability of simulations; emulations of real systems.\n* Mechanisms fo"
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE259",
    "id": "PEPM",
    "title": "Partial Evaluation and Program Manipulation",
    "categories": [
      "Compilers",
      "Formal languages and automata theory",
      "Functional languages",
      "Lambda calculus",
      "Language features",
      "Language types",
      "Logic",
      "Program analysis",
      "Program constructs",
      "Program reasoning",
      "Program semantics",
      "Semantics and reasoning",
      "Software development process management",
      "Source code generation",
      "Type structures"
    ],
    "description": "The PEPM Symposium/Workshop series aims at bringing together researchers and practitioners working in the areas of program manipulation, partial evaluation, and program generation. PEPM focuses on techniques, theory, tools, and applications of analysis and manipulation of programs."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE200",
    "id": "PLDI",
    "title": "Programming Language Design and Implementation",
    "categories": [
      "Compilers",
      "Concurrent programming languages",
      "Formal software verification",
      "Language features",
      "Language types",
      "Logic",
      "Parallel programming languages",
      "Program analysis",
      "Program semantics",
      "Program verification",
      "Semantics and reasoning",
      "Software development process management",
      "Software testing and debugging",
      "Software verification",
      "Verification"
    ],
    "description": "PLDI is a forum where researchers, developers, educators, and practitioners exchange information on the latest practical and experimental work in the design and implementation of programming languages. PLDI seeks original research papers that focus on the design, implementation, development, and use of programming languages. PLDI emphasizes innovative and creative approaches to compile-time and runtime technology; novel language designs and features; and results from implementations."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE129",
    "id": "PLoP",
    "title": "Pattern Languages of Programs",
    "categories": [
      "Client-server architectures",
      "Computer science education",
      "Designing software",
      "Human computer interaction ",
      "Machine learning",
      "Object oriented languages",
      "Patterns",
      "Project and people management",
      "Reusability",
      "Software architectures",
      "Software configuration management and version control systems",
      "Software creation and management",
      "Software design techniques",
      "Software development process management",
      "Software management"
    ],
    "description": "Pattern Languages of Programs (PLoP™) conference is a premier event for pattern authors and pattern enthusiasts to gather, discuss and learn more about patterns and software development.\n\nThe purpose of PLoP is to promote development of pattern languages, primarily about aspects of software: design and programming, testing, software architecture, user interface design, domain modelling, and software processes. Patterns and pattern languages for domains outside software are also welcome."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE221",
    "id": "PODC",
    "title": "Principles of Distributed Computing",
    "categories": [
      "Concurrency",
      "Concurrent programming languages",
      "Dependable and fault-tolerant systems and networks",
      "Design and analysis of algorithms",
      "Distributed architectures",
      "Distributed programming languages",
      "Distributed systems organizing principles",
      "Network architectures",
      "Network flows",
      "Network protocols",
      "Organizing principles for web applications",
      "Parallel computing models",
      "Parallel programming languages",
      "Performance",
      "Randomness, geometry and discrete structures"
    ],
    "description": "PODC is a conference that focuses on research in the theory, design, specification and implementation of distributed systems. PODC is sponsored by ACM, SIGACT, and SIGOPS.\nPODC solicits papers on all areas of distributed systems. We encourage submissions dealing with any aspect of distributed computing from theoretical or experimental viewpoints. The common goal is to improve understanding of the principles underlying distributed computing. Topics of interest include the following subjects in distributed systems:\n* distributed algorithms: design and analysis\n* communication networks: architectures, services, protocols, applications\n* multiprocessor and multi-core architectures and algorithms\n* shared and transactional memory, synchronization protocols, concurrent programming\n* fault-tolerance, reliability, availability, self organization\n* internet applications, social networks, rec"
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE180",
    "id": "POPL",
    "title": "Principles of Programming Languages",
    "categories": [
      "Compilers",
      "Formal language definitions",
      "Formal languages and automata theory",
      "Formal software verification",
      "Lambda calculus",
      "Language features",
      "Language types",
      "Logic",
      "Program reasoning",
      "Program semantics",
      "Program verification",
      "Semantics and reasoning",
      "Software development process management",
      "Type structures",
      "Verification"
    ],
    "description": "The annual Symposium on Principles of Programming Languages is a forum for the discussion of all aspects of programming languages and systems, with emphasis on how principles underpin practice. Both theoretical and experimental papers are welcome, on topics ranging from formal frameworks to experience reports."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE241",
    "id": "PPoPP",
    "title": "Principles and Practice of Parallel Programming",
    "categories": [
      "Compilers",
      "Concurrency",
      "Concurrent programming languages",
      "Concurrent programming structures",
      "Distributed programming languages",
      "Language features",
      "Language types",
      "Mathematical software",
      "Multiple instruction, multiple data",
      "Parallel algorithms",
      "Parallel architectures",
      "Parallel computing models",
      "Parallel programming languages",
      "Performance",
      "Software testing and debugging"
    ],
    "description": "PPoPP is a forum for leading work on all aspects of parallel programming, including foundational results, techniques, tools, and practical experience. In the context of the symposium, \"parallel programming\" is construed to encompass work on concurrent, multithreaded, multicore, accelerated, multiprocessor, and tightly-clustered systems. Given the rise of multicore processors, PPoPP is particularly interested in work that seeks to transition parallel programming into the computing mainstream."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE297",
    "id": "RecSys",
    "title": "ACM Conference On Recommender Systems",
    "categories": [
      "Collaborative filtering",
      "Data mining",
      "Decision support systems",
      "Document filtering",
      "Human computer interaction ",
      "Information extraction",
      "Information retrieval query processing",
      "Information retrieval",
      "Information systems applications",
      "Machine learning",
      "Markov decision processes",
      "Personalization",
      "Recommender systems",
      "Retrieval models and ranking",
      "Retrieval tasks and goals"
    ],
    "description": "The 5th ACM International Conference on Recommender Systems builds on the success of the Recommenders 06 Summer School in Bilbao, Spain and the series of four successful conference events from 2007 to 2010 in Minneapolis (2007), Lausanne (2008), New York(2009) and Barcelona (2010).\nIn addition to a regular technical program, there will be several tutorials covering the state-of-the-art of this domain, different workshops, a doctoral consortium, and an industrial program comprising of panel discussions and a practice/industry-paper track. We also expect to have keynote speakers who will address the major applications of recommendation technologies in industry."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE133",
    "id": "SAC",
    "title": "Symposium on Applied Computing",
    "categories": [
      "Data mining",
      "Dependable and fault-tolerant systems and networks",
      "Designing software",
      "Discrete mathematics",
      "Distributed architectures",
      "Distributed systems organizing principles",
      "Information retrieval",
      "Information systems applications",
      "Machine learning",
      "Mathematical optimization",
      "Model development and analysis",
      "Network performance evaluation",
      "Performance",
      "Software architectures",
      "Software development process management"
    ],
    "description": "The ACM Symposium on Applied Computing (SAC) has been a primary and international forum for applied computer scientists, computer engineers and application developers to gather, interact and present their work. The ACM Special Interest Group on Applied Computing (SIGAPP) is the sole sponsor of SAC. The conference proceedings are published by ACM and are also available online through ACM's Digital Library. Authors are invited to contribute original papers in all areas of experimental computing and application development for the technical sessions."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE125",
    "id": "SACMAT",
    "title": "Symposium on Access Control Models and Technologies",
    "categories": [
      "Access control",
      "Authentication",
      "Computer crime",
      "Cryptanalysis and other attacks",
      "Data mining",
      "Database and storage security",
      "Enterprise computing",
      "Human computer interaction ",
      "Information flow control",
      "Intrusion/anomaly detection and malware mitigation",
      "Modeling and simulation",
      "Operating systems security",
      "Organizing principles for web applications",
      "Security and privacy",
      "Theory of database privacy and security"
    ],
    "description": "The ACM Symposium on Access Control Models and Technologies (SACMAT) is the premier forum for the presentation of research results and experience reports on leading edge issues of access control, including models, systems, applications, and theory. The aims of the symposium are to share novel access control solutions that fulfil the needs of heterogeneous applications and environments, and to identify new directions for future research and development. SACMAT provides researchers and practitioners with a unique opportunity to share their perspectives with others interested in the various aspects of access control."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE131",
    "id": "SBCCI",
    "title": "Symposium on Integrated Circuits and System Design",
    "categories": [
      "Application specific processors",
      "Communication hardware, interfaces and storage",
      "Embedded and cyber-physical systems",
      "Emerging technologies",
      "Hardware test",
      "Hardware validation",
      "Hardware",
      "High-level and register-transfer level synthesis",
      "Integrated circuits",
      "Logic circuits",
      "Physical design ",
      "Real-time systems",
      "Robustness",
      "Simulation and emulation",
      "Very large scale integration design"
    ],
    "description": "SBCCI is an international forum dedicated to integrated circuits and systems design, test and CAD, held annually in Brazil. The goal of the symposium is to bring together researchers in the areas of computer-aided design, design and test of integrated circuits and systems. The scope of the symposium includes technical sessions, tutorials and panels, as well as exhibition and working group meetings. The best papers presented at the symposium will be invited to resubmit an extended version to be considered for publication at the IEEE Design & Test and at the JICS - Journal of Integrated Circuits and Systems."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE207",
    "id": "SC",
    "title": "The International Conference for High Performance Computing, Networking, Storage, and Analysis",
    "categories": [
      "Architectures",
      "Compilers",
      "Concurrent programming languages",
      "Dependable and fault-tolerant systems and networks",
      "Distributed architectures",
      "Distributed systems organizing principles",
      "Grid computing",
      "Massively parallel and high-performance simulations",
      "Multicore architectures",
      "Network performance evaluation",
      "Parallel algorithms",
      "Parallel architectures",
      "Parallel programming languages",
      "Performance",
      "Superscalar architectures"
    ],
    "description": "Established in 1988, the annual SC conference has built a diverse community of participants including researchers, scientists, application developers, computing center staff and management, computing industry staff, agency program managers, journalists, and congressional staffers. This diversity is one of the conference's main strengths, making it a yearly \"must attend\" forum for stakeholders throughout the technical computing community.The technical program is the heart of SC. It has addressed virtually every area of scientific and engineering research, as well as technological development, innovation, and education. Its presentations, tutorials, panels, and discussion forums have included breakthroughs in many areas and inspired new and innovative areas of computing."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE369",
    "id": "SCA",
    "title": "Symposium on Computer Animation",
    "categories": [
      "3D imaging",
      "Animation",
      "Computational geometry",
      "Computer graphics",
      "Geometric topology",
      "Graphics input devices",
      "Graphics systems and interfaces",
      "Image manipulation",
      "Mathematical optimization",
      "Parametric curve and surface models",
      "Physical simulation",
      "Randomness, geometry and discrete structures",
      "Rendering",
      "Shape modeling",
      "Simulation by animation"
    ],
    "description": "The Symposium on Computer Animation (SCA) is the premier forum for innovations in the software and technology of computer animation. The eighth annual event unites researchers and practitioners working on all aspects of time-based phenomena. Our focused, intimate gathering, with single track program and emphasis on community interaction, makes SCA the best venue to exchange research results, get inspired, and set up collaborations."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE188",
    "id": "SenSys",
    "title": "Embedded Network Sensor Systems",
    "categories": [
      "Communication hardware, interfaces and storage",
      "Distributed architectures",
      "Distributed systems organizing principles",
      "Embedded and cyber-physical systems",
      "Information systems applications",
      "Mobile networks",
      "Network architectures",
      "Network performance evaluation",
      "Network protocols",
      "Networks",
      "Organizing principles for web applications",
      "Performance",
      "Real-time systems",
      "Signal processing systems",
      "Wireless access networks"
    ],
    "description": "The ACM Conference on Embedded Networked Sensor Systems (SenSys) is a highly selective, single-track forum for the presentation of research results on systems issues in the area of embedded, networked sensors. Distributed systems based on networked sensors and actuators with embedded computation capabilities allow for an instrumentation of the physical world at an unprecedented scale and density, thus enabling a new generation of monitoring and control applications. SenSys provides a cross-disciplinary venue for researchers addressing the rich space of networked sensor system design issues to interact, present and exchange research results, and demonstrate their work in a hands-on research exhibition."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE214",
    "id": "SIGGRAPH",
    "title": "International Conference on Computer Graphics and Interactive Techniques",
    "categories": [
      "3D imaging",
      "Animation",
      "Computational geometry",
      "Computer graphics",
      "Fine arts",
      "General and reference",
      "Graphics recognition and interpretation",
      "Graphics systems and interfaces",
      "Image manipulation",
      "Parametric curve and surface models",
      "Performing arts",
      "Randomness, geometry and discrete structures",
      "Rendering",
      "Shape modeling",
      "Virtual reality"
    ],
    "description": "SIGGRAPH (short for Special Interest Group on GRAPHics and Interactive Techniques) is the name of the annual conference on computer graphics (CG) convened by the ACM SIGGRAPH organization. The first SIGGRAPH conference was in 1974. The conference is attended by tens of thousands of computer professionals. Past SIGGRAPH conferences have been held in Los Angeles, Dallas, New Orleans, Boston and elsewhere across the United States."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE333",
    "id": "SLIP",
    "title": "System Level Interconnect Prediction",
    "categories": [
      "Computer-aided design",
      "Dependable and fault-tolerant systems and networks",
      "Emerging technologies",
      "Hardware validation",
      "Interconnection architectures",
      "Interconnect",
      "Modeling methodologies",
      "Network performance evaluation",
      "Partitioning and floorplanning",
      "Performance",
      "Physical design ",
      "Placement",
      "Simulation and emulation",
      "Very large scale integration design",
      "Wire routing"
    ],
    "description": "The general technical scope of the System Level Interconnect Prediction (SLIP)workshop is the design, analysis and prediction of intercommunication fabrics in electronic systems. \nRepresentative technical topics include, but are not limited to,\ninterconnect prediction at various IC design stages, interconnect design challenges and system-level NoC design, design and analysis of power and clock networks, interconnect architecture of structural designs and FPGAs,interconnect fabrics of many-core architectures, design-for-manufacturing (DFM) techniques for interconnects, high speed PCB interconnect design, design and analysis of chip-package interfaces, interconnect topologies of multiprocessor systems,interconnect design and prediction of through-silicon vias (TSV) in 3D ICs, emerging interconnect technologies, synergies between chip intercommunication networks and networks arising in other contexts such as social networks, system biology."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE382",
    "id": "SODA",
    "title": "Symposium on Discrete Algorithms",
    "categories": [
      "Approximation algorithms analysis",
      "Approximation",
      "Combinatorial algorithms",
      "Complexity classes",
      "Computational complexity and cryptography",
      "Computational geometry",
      "Design and analysis of algorithms",
      "Discrete mathematics",
      "Graph algorithms",
      "Mathematical optimization",
      "Network flows",
      "Randomness, geometry and discrete structures",
      "Scheduling algorithms",
      "Sequential decision making",
      "Trees"
    ],
    "description": "This symposium focuses on research topics related to efficient algorithms and data structures for discrete problems. In addition to the design of such methods and structures, the scope also includes their use, performance analysis, and the mathematical problems related to their development or limitations. Performance analyses may be analytical or experimental and may address worst-case or expected-case performance. Studies can be theoretical or based on data sets that have arisen in practice and may address methodological issues involved in performance analysis."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE208",
    "id": "SOSP",
    "title": "ACM Symposium on Operating Systems Principles",
    "categories": [
      "Dependable and fault-tolerant systems and networks",
      "Designing software",
      "Distributed architectures",
      "Distributed systems organizing principles",
      "File systems management",
      "Memory management",
      "Multiprocessing / multiprogramming / multitasking",
      "Network performance evaluation",
      "Operating systems security",
      "Operating systems",
      "Performance",
      "Reliability",
      "Software performance",
      "Software reliability",
      "Storage management"
    ],
    "description": "The biennial ACM Symposium on Operating Systems Principles is the world's premier forum for researchers, developers, programmers, vendors and teachers of operating system technology. Academic and industrial participants present research and experience papers that cover the full range of theory and practice."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE199",
    "id": "SPAA",
    "title": "ACM Symposium on Parallel Algorithms and Architectures",
    "categories": [
      "Concurrency",
      "Concurrent programming languages",
      "Design and analysis of algorithms",
      "Models of computation",
      "Network flows",
      "Parallel algorithms",
      "Parallel architectures",
      "Parallel computing models",
      "Parallel programming languages",
      "Performance",
      "Randomness, geometry and discrete structures",
      "Routing and network design problems",
      "Scheduling algorithms",
      "Sequential decision making",
      "Sorting and searching"
    ],
    "description": "The Annual ACM Symposium on Parallelism in Algorithms and Architectures (SPAA) defines the term 'parallel' broadly, encompassing any computational system that can perform multiple operations or tasks simultaneously. Topics include, but are not limited to,\nParallel and Distributed Algorithms, Parallel and Distributed Data Structures,\nGreen Computing and Power-Efficient Architectures, Management of Massive Data Sets,\nParallel Complexity Theory, Parallel and Distributed Architectures,\nMulti-Core Architectures, Instruction Level Parallelism and VLSI,\nCompilers and Tools for Concurrent Programming, Supercomputer Architecture and Computing,\nTransactional Memory Hardware and Software, The Internet and the World Wide Web,\nGame Theory and Collaborative Learning, Routing and Information Dissemination,\nResource Management and Awareness, Peer-to-Peer Systems,\nMobile Ad-Hoc and Sensor Networks, Robustness, Self-Stabilization and Security,\nSynergy of parallelism in algorithm"
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE181",
    "id": "SPLASH",
    "title": "Systems, Programming, and Applications",
    "categories": [
      "Compilers",
      "Concurrent programming languages",
      "Designing software",
      "Development frameworks and environments",
      "Integrated and visual development environments",
      "Language features",
      "Language types",
      "Object oriented languages",
      "Parallel programming languages",
      "Reusability",
      "Software architectures",
      "Software design techniques",
      "Software development process management",
      "Software development techniques",
      "Software testing and debugging"
    ],
    "description": "SPLASH's mission is to engage software innovators from all walks of life -- developers, academics and undeclared -- in conversations about bettering software. Bettering software involves new ideas about programming languages, tools, conceptual models, and methodologies that can cope with, evolve, and leverage, the complex software-intensive socio-technical system of systems that has emerged in front of our eyes during the past decades. Bettering software requires a deep understanding of the nature of these systems, an understanding that rides on the trends of the moment, but that goes well beyond. These are the topics of SPLASH.\nSPLASH has three general tracks: OOPSLA, Onward! and Wavefront.\nOOPSLA -- High quality research work that uses established scientific methodologies, written using high standards of academic technical publications.\nOnward! -- Innovative ideas that challenge existing beliefs, or early work well written and well argued for."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE224",
    "id": "STOC",
    "title": "ACM Symposium on Theory of Computing",
    "categories": [
      "Complexity classes",
      "Computational complexity and cryptography",
      "Computational geometry",
      "Computations on polynomials",
      "Design and analysis of algorithms",
      "Discrete mathematics",
      "Formal languages and automata theory",
      "Graph algorithms",
      "Graph theory",
      "Models of computation",
      "Network flows",
      "Probabilistic computation",
      "Randomness, geometry and discrete structures",
      "Scheduling algorithms",
      "Theory of computation"
    ],
    "description": "The ACM Symposium on Theory of Computing (STOC) includes topics of interest such as: algorithms and data structures, computational complexity, cryptography, privacy, computational geometry, algorithmic graph theory and combinatorics, optimization, randomness in computing, approximation algorithms, parallel and distributed computation, machine learning, applications of logic, algorithmic algebra and coding theory, computational biology, computational game theory, quantum computing, and theoretical aspects of areas such as robotics, databases, information retrieval, and networks. Papers that broaden the reach of theory, or raise important problems that can benefit from theoretical investigation and analysis, are encouraged."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE624",
    "id": "SUI",
    "title": "Spatial User Interaction",
    "categories": [
      "Gestural input",
      "Haptic devices",
      "HCI design and evaluation methods",
      "Human computer interaction ",
      "Human-centered computing",
      "Interaction design theory, concepts and paradigms",
      "Interaction devices",
      "Interaction paradigms",
      "Interaction techniques",
      "Mixed / augmented reality",
      "Multimedia information systems",
      "Touch screens",
      "User interface design",
      "User studies",
      "Virtual reality"
    ],
    "description": "The ACM Symposium on Spatial User Interaction (SUI) is the first international symposium focused on the user interface challenges that appear when users interact in the space where the flat, two-dimensional, digital world meets the volumetric, physical, three-dimensional (3D) space we live in. This considers both spatial input and 3D output, with an emphasis on the issues around interaction between humans and systems.Due to the advances in 3D technologies, spatial interaction is now more relevant than ever. Powerful graphics engines and high-resolution screens are now ubiquitous in everyday devices, such as tablets and mobile phones. Moreover, new forms of input, such as multi-touch, finger and body tracking technologies are now easily available. In this environment, spatial UIs are transitioning out of the research community and game industry. More and more commercial 3D systems with spatial interaction capabilities exist, many priced at the consumer level. Until now, the"
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE271",
    "id": "TEI",
    "title": "Tangible and Embedded Interaction",
    "categories": [
      "Arts and humanities",
      "Haptic devices",
      "HCI theory, concepts and models",
      "Human computer interaction ",
      "Human-centered computing",
      "Interaction design theory, concepts and paradigms",
      "Interaction devices",
      "Interaction paradigms",
      "Interface design prototyping",
      "Multimedia information systems",
      "Music retrieval",
      "Sound and music computing",
      "Touch screens",
      "User centered design",
      "Virtual reality"
    ],
    "description": "TEI is dedicated to presenting the latest results in tangible, embedded, and embodied interaction. \nThe work presented at TEI addresses HCI issues, design, interactive art, user experience, tools and technologies, with a strong focus on how computing can finally bridge atoms and bits into cohesive interactive systems. The intimate size of this single-track conference provides a unique forum for exchanging ideas and presenting innovative work through talks, interactive exhibits, demos, hands-on studios, posters, art installations and performances."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE336",
    "id": "UbiComp",
    "title": "Ubiquitous Computing",
    "categories": [
      "Cognitive science",
      "Embedded and cyber-physical systems",
      "Human computer interaction ",
      "Human-centered computing",
      "Information retrieval",
      "Information systems applications",
      "Information systems",
      "Interaction devices",
      "Law, social and behavioral sciences",
      "Machine learning",
      "Personal computers and PC applications",
      "Real-time systems",
      "Signal processing systems",
      "Touch screens",
      "User centered design"
    ],
    "description": "Ubicomp is a premier venue for presenting research in the design, development, deployment, evaluation and understanding of ubiquitous computing systems. Ubicomp is an interdisciplinary field of research and development that utilizes and integrates pervasive, wireless, embedded, wearable and/or mobile technologies to bridge the gaps between the digital and physical worlds. Ubicomp will bring together top researchers and practitioners who are interested in both the technical and applied aspects of Ubiquitous Computing technologies, systems and applications. The Ubicomp program features keynotes, technical paper and notes sessions, specialized workshops, live demonstrations, posters, video presentations, and a Doctoral Colloquium."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE204",
    "id": "UCCS",
    "title": "SIGUCCS User Services Conference",
    "categories": [
      "Computer and information systems training",
      "Computer crime",
      "Computer science education",
      "Computing education",
      "Digital libraries and archives",
      "Education",
      "Enterprise computing",
      "Human computer interaction ",
      "Information science education",
      "Management of computing and information systems",
      "Network architectures",
      "Personal computers and PC applications",
      "Project and people management",
      "Project management techniques",
      "Project staffing"
    ],
    "description": "The Special Interest Group on University and College Computing Services (SIGUCCS) is an association of professionals who support and manage the diverse aspects of information technology services at higher education institutions.\nSIGUCCS is one of 34 special interest groups of ACM, the Association for Computing Machinery, the world's largest educational and scientific computing society.\nSIGUCCS focuses on issues surrounding the support, delivery, and management of those services, and provides professional development opportunities for its members and the other individuals in the field."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE172",
    "id": "UIST",
    "title": "User Interface Software and Technology",
    "categories": [
      "Collaborative and social computing",
      "Graphical user interfaces",
      "Graphics input devices",
      "Graphics systems and interfaces",
      "Haptic devices",
      "Human computer interaction ",
      "Human-centered computing",
      "Integrated and visual development environments",
      "Interaction devices",
      "Interaction paradigms",
      "Interface design prototyping",
      "Multimedia information systems",
      "Software development process management",
      "Touch screens",
      "Virtual reality"
    ],
    "description": "UIST (ACM Symposium on User Interface Software and Technology) is the premier forum for innovations in the software and technology of human-computer interfaces. Sponsored by ACM's special interest groups on computer-human interaction (SIGCHI) and computer graphics (SIGGRAPH), UIST brings together researchers and practitioners from diverse areas that include traditional graphical & web user interfaces, tangible & ubiquitous computing, virtual & augmented reality, multimedia, new input & output devices, and CSCW. The intimate size, the single track, and comfortable surroundings make this symposium an ideal opportunity to exchange research results and implementation experiences."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE278",
    "id": "VALUETOOLS",
    "title": "Performance Evaluation Methodologies and Tools",
    "categories": [
      "Dependable and fault-tolerant systems and networks",
      "Markov decision processes",
      "Markov processes",
      "Mathematical optimization",
      "Mobile networks",
      "Model development and analysis",
      "Model verification and validation",
      "Modeling methodologies",
      "Network architectures",
      "Network performance evaluation",
      "Network protocols",
      "Performance",
      "Probability and statistics",
      "Queueing theory",
      "Wireless access networks"
    ],
    "description": "In recent years, a range of performance evaluation methodologies and tools has been developed within disparate research communities for the purposes of evaluation, design, and model reduction. The aim of the Performance Evaluation Methodologies and Tools conference is to build bridges between these communities, bringing theory and practice together in order to:\n* compare and debate the complete range of performance evaluation methodologies and their implementation into tools \n* promote interdisciplinary flow of technical information among industry systems designers and researchers."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE287",
    "id": "VEE",
    "title": "ACM SIGPLAN/SIGOPS International Conference on Virtual Execution Environments (VEE)",
    "categories": [
      "Compilers",
      "Designing software",
      "Distributed systems organizing principles",
      "File systems management",
      "Garbage collection",
      "Measurement",
      "Memory management",
      "Operating systems security",
      "Operating systems",
      "Performance",
      "Runtime environments",
      "Scheduling",
      "Software performance",
      "Software testing and debugging",
      "Source code generation"
    ],
    "description": "Virtualization has a central role in modern systems. It constitutes a key aspect in a wide range of environments, from small mobile computing devices to large-scale data centers and computational clouds. Virtualization techniques are used across all layers of the software stack down to the microarchitectural level, encompassing the underlying hardware, the operating system, and the runtime system. While the approaches at different layers can differ dramatically, they tend to have similarities, and they must often tackle related challenges. The ACM SIGPLAN/SIGOPS International Conference on Virtual Execution Environments (VEE) brings together researchers and practitioners from different computer systems domains to interact and share ideas in order to advance the state of the art of virtualization and to broaden its applicability."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE137",
    "id": "VRST",
    "title": "Virtual Reality Software and Technology",
    "categories": [
      "3D imaging",
      "Animation",
      "Computer graphics",
      "Computer vision problems",
      "Graphics input devices",
      "Graphics systems and interfaces",
      "Haptic devices",
      "Human computer interaction ",
      "Image manipulation",
      "Interaction paradigms",
      "Mixed / augmented reality",
      "Rendering",
      "Scene understanding",
      "Shape modeling",
      "Virtual reality"
    ],
    "description": "The ACM Symposium on Virtual Reality Software and Technology (VRST) is an international forum for the exchange of experience and knowledge among researchers and developers concerned with virtual reality software and technology. VRST will provide an opportunity for VR researchers to interact, share new results, show live demonstrations of their work, and discuss emerging directions for the field."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE123",
    "id": "Web3D",
    "title": "3D technologies for the World Wide Web",
    "categories": [
      "3D imaging",
      "Animation",
      "Computer graphics",
      "Document preparation",
      "Graphics input devices",
      "Graphics recognition and interpretation",
      "Graphics systems and interfaces",
      "Image manipulation",
      "Interaction techniques",
      "Mixed / augmented reality",
      "Shape modeling",
      "Special purpose systems",
      "Texturing",
      "Virtual reality",
      "Web-based interaction"
    ],
    "description": "The annual ACM Web3D Conference is a major event which unites researchers, developers, entrepreneurs, experimenters, artists and content creators in a dynamic learning environment. Attendees share and explore methods of using, enhancing and creating new 3D Web and Multimedia technologies such as X3D, VRML, Collada, MPEG family, U3D, Java3D and other technologies. The conference also focuses on recent trends in interactive 3D graphics, information integration and usability in the wide range of Web3D applications from mobile devices to high-end immersive environments."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE621",
    "id": "WebSci",
    "title": "Web Science ",
    "categories": [
      "Collaborative and social computing systems and tools",
      "Collaborative and social computing",
      "Computing / technology policy",
      "Data mining",
      "Empirical studies in collaborative and social computing",
      "Human computer interaction ",
      "Human-centered computing",
      "Information retrieval",
      "Information systems applications",
      "Law, social and behavioral sciences",
      "Natural language processing",
      "Social networking sites",
      "Social networks",
      "Sociology",
      "Web-based interaction"
    ],
    "description": "Web Science is concerned with the full scope of socio-technical relationships that are engaged in the World Wide Web. It is based on the notion that understanding the Web involves not only an analysis of its architecture and applications, but also insight into the people, organizations, policies, and economics that are affected by and subsumed within it. As such Web Science, and thus this conference, is inherently interdisciplinary and integrates computer and information sciences with a multitude of disciplines including sociology, economics, political science, law, management, language and communication, geography and psychology. This conference is unique in the manner in which it brings these disciplines together in creative and critical dialogue."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE295",
    "id": "WISEC",
    "title": "Security and Privacy in Wireless and Mobile Networks",
    "categories": [
      "Access control",
      "Authentication",
      "Communication hardware, interfaces and storage",
      "Computer crime",
      "Cryptanalysis and other attacks",
      "Intrusion/anomaly detection and malware mitigation",
      "Mobile and wireless security",
      "Mobile networks",
      "Network protocols",
      "Network security",
      "Networks",
      "Operating systems security",
      "Personal computers and PC applications",
      "Security and privacy",
      "Wireless access networks"
    ],
    "description": "As wireless networks become ubiquitous, their security gains in importance. The ACM Conference on Wireless Network Security (WiSec) aims at exploring attacks on wireless networks as well as techniques to thwart them. The considered networks encompass cellular, metropolitan, local area, vehicular, ad hoc, satellite, underwater, cognitive radio, and sensor networks, as well as RFID.\nWiSec results from the merger of three workshops:\n* ESAS (European Workshop on the Security of Ad Hoc and Sensor Networks)\n* SASN (ACM Workshop on the Security of Ad Hoc and Sensor Networks)\n* WiSe (ACM Workshop on Wireless Security)"
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE193",
    "id": "WSC",
    "title": "Winter Simulation Conference",
    "categories": [
      "Discrete-event simulation",
      "Engineering",
      "Enterprise computing",
      "Industry and manufacturing",
      "Mathematical optimization",
      "Military",
      "Model development and analysis",
      "Model verification and validation",
      "Modeling and simulation",
      "Modeling methodologies",
      "Simulation evaluation",
      "Simulation languages",
      "Simulation support systems",
      "Simulation types and techniques",
      "Surveys and overviews"
    ],
    "description": "The Winter Simulation Conference (WSC) is the premier international forum for disseminating recent advances in the field of system simulation. In addition to a technical program of unsurpassed scope and quality, WSC provides the central meeting place for simulation practitioners, researchers, and vendors working in all disciplines in industrial, governmental, military, and academic sectors."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE102",
    "id": "WSDM",
    "title": "Web Search and Data Mining",
    "categories": [
      "Data mining",
      "Document filtering",
      "Document representation",
      "Human computer interaction ",
      "Information extraction",
      "Information retrieval query processing",
      "Information retrieval",
      "Information storage systems",
      "Information systems applications",
      "Machine learning",
      "Markov decision processes",
      "Natural language processing",
      "Retrieval models and ranking",
      "Web applications",
      "Web services"
    ],
    "description": "WSDM (pronounced \"wisdom\") is a young ACM conference intended to be the publication venue for research in the areas of search and data mining. Indeed, the pace of innovation in these areas prevents proper coverage by conferences of broader scope."
  },
  {
    "url": "https://dl.acm.org/event.cfm?id=RE334",
    "id": "WWW",
    "title": "International World Wide Web Conference",
    "categories": [
      "Data mining",
      "Document filtering",
      "Document representation",
      "Human computer interaction ",
      "Hypertext / hypermedia",
      "Information extraction",
      "Information retrieval query processing",
      "Information retrieval",
      "Information storage systems",
      "Information systems applications",
      "Multi / mixed media creation",
      "Natural language processing",
      "Retrieval models and ranking",
      "Web applications",
      "Web services"
    ],
    "description": "The World Wide Web Conference is the global event that brings together key researchers, innovators, decision-makers, technologists, businesses, and standards bodies working to shape the Web."
  }
]